class StringsInterviewRu {
  StringsInterviewRu._();

  static const List<String> success_interview_text_more = [
    'Каждому из нас в течение жизни необходимо проходить не одно собеседование, перед тем как удается найти работу, '
        'которая будет в полной мере соответствовать потребностям и ожиданиям и, которой подойдете именно Вы. '
        'Нередко причиной длительного поиска работы является высокая конкуренция на рынке труда и тот факт, '
        'что предложение значительно превышает спрос. Поэтому важно уметь «продать» себя как специалиста, особенно для тех, '
        'чья работа связанна с регулярным общением с клиентами. ',
    'По причине того, что количество соискателей находящихся в поиске работы больше, '
        'чем вакантных должностей не зависимо от отрасли или должности, специалисты по подбору, '
        'вынуждены придумывать все более и более изощренные вопросы, чтобы еще на первых этапах '
        '(телефонное интервью, собеседование с менеджером по подбору) отсеять слабых кандидатов. '
        'Поэтому далее наше кадровое агентство предлагает рассмотреть наиболее сложные вопросы для соискателей, '
        'но информативные для интервьюера.',
    'Распространенным первым вопросов менеджеров по подбору / руководителей является просьба рассказать о себе. '
        'Нередко человек теряется, так как не знает, что хотят от него услышать, однако данный вопрос требует от Вас лишь краткой, '
        'но емкой справки о следующем: ',
    'Ваше образование, год окончания.',
    'Ваш опыт работы.',
    'Акцент в описании опыта работы делается на тех компаниях и должностях, '
        'которые полностью или в большей степени соответствуют должности, на которую Вы претендуете в данной компании. '
        'При этом от Вас требуется очертить круг Ваших обязанностей и по возможности достижений. '
        'Если такого опыта много, получен в разных компаниях, то расскажите о последних двух-трех местах работы либо о тех, '
        'где Вы работали наиболее длительное время. Информация об иных должностях, компаниях может даваться, но тезисно либо в случае, '
        'если у Вас незначительный профильный опыт.',
    'Информация относительно карьерного роста также дается тезисно, если у интервьюера возникнут '
        'вопросы или интерес к конкретному опыту/ месту работы, он сам попросит Вас дать развернутый ответ. '
        'Описывать опыт работы старайтесь исходя из тех обязанностей, которые предстоит выполнять на новом месте работы, '
        'т.е. переформулируйте обязанности указанные в описании вакансии, соотнося со своим опытом.',
    'Завершая презентацию своего опыта, Вы можете пояснить причины поиска работы в данный момент. '
        'Если у Вас есть ощущение, что работодатель хочет услышать от Вас еще что-то, а Вы уже все рассказали, '
        'то хорошим завершением будет сказать о Вашем хобби.',
    'Получив краткий и ёмкий ответ на просьбу рассказать о себе, далее менеджер задает вопросы, '
        'которые касаются наиболее значимых знаний, навыков, умений выполнять конкретные профессиональные задачи. '
        'Все чаще для прояснения опыта решения трудовых задач менеджеры по подбору персонала используют кейсы, '
        'то есть моделируют рабочую ситуацию, смотрят на реакцию, делают выводы.',
    'Причины ухода с предыдущего места работы?',
    'Специалисту, проводящему отбор необходимо понять, что не устраивало Вас на прежнем месте и чего ожидаете от новой работы. '
        'Важно! Не отзывайтесь плохо о прежнем руководстве, коллегах, так как это некрасиво и вызывает подозрение о Ваших способностях '
        'налаживать взаимоотношения с коллективом. Наиболее приемлемым будет сказать, что Вас не устраивал график работы, '
        'территориальное местоположение, работа носила рутинный характер, отсутствовали перспективы профессионального и карьерного развития. '
        'При этом лучше выбрать один-два фактора, которые будут правдивыми, и отсутствуют в новой компании.',
    'В последнюю очередь стоит говорить о желании зарабатывать больше, давая понять потенциальному работодателю, '
        'что деньги — это не самое главное в работе. Однако, если Вы менеджер по продажам, то приемлемо в первую очередь делать акцент '
        'на возможности получать больше, так как Ваша главная задача приносить в компанию как можно больше денег. '
        'Отсутствие возможностей в предыдущей компании наращивать обороты по продажам и тем самым свой доход — для многих менеджеров '
        'является уважительной причиной смены работы.',
    'Завершая ответ на данный вопрос, чтобы снять у менеджера по подбору любые сомнения в Вашей компетентности, '
        'профессионализме, неконфликтности и т.д. скажите, что готовы предоставить рекомендации с последних мест работы '
        'от непосредственных руководителей, НО будьте уверенны, что рекомендации дадут действительно положительные!',
    'Ваши ожидания по заработной плате?'
        'Достаточно успешным является ответ, что заработная плата должна соответствовать тем обязанностям, которые будут на Вас возложены. '
        'Однако потенциальный работодатель должен понимать, сможет ли он обеспечить Вас теми доходам, на которые Вы претендуете. '
        'Поэтому Вы можете обозначить доход на последнем месте работы, как минимальный, а желаемый выше на 20-30%. '
        'Но не забывайте о том, что Ваши ожидания не должны значимо превышать ту сумму, которую сможет обеспечить новая компания.',
    'Расскажите о Ваших недостатках?',
    'Все люди и у каждого есть недостатки. Отвечать честно на данный вопрос не стоит, лучше всего уклонится от ответа, '
        'сказав, что у Вас отсутствуют недостатки, которые будут мешать Вашей работе. Либо можно отшутиться, сказав, что для '
        'Вас иногда характерно терять ход времени, увлекшись работой.',
    'Какие достижения были у Вас на предыдущей работе?',
    'Данный вопрос требует от Вас снова краткого, но емкого ответа. Расскажите о том, что успешно реализовали проект, '
        'привели крупного заказчика, увеличили объем продаж и т.п. Можете подкрепить ответ иллюстрацией самого большого достижения, '
        'например, проведя успешные переговоры с клиентом «N» Вам удалось заключить договор о продаже товаров на сумму «Х», '
        'что ранее не удавалось никому из сотрудников.',
    'Как Вы относитесь к высокоинтенсивной работе, переработкам?;',
    'Для начала уточните, что именно подразумевается под данным вопросом. Придется ли Вам сидеть до полуночи или работать одному '
        'за целый отдел? Если ответ и условия приемлемы для Вас, то скажите, что имели опыт работы в аналогичных условиях, '
        'и успешно справлялись.',
    'Что вы знаете о нашей компании и чего ожидаете от работы?',
    'Если Вы идете на собеседование непосредственно к работодателю, то обязаны заранее посмотреть информацию о нем: '
        'чем занимается компания, как давно на рынке, преимущества и т.д. Поиск информации заранее не только поможет успешно пройти '
        'собеседование, но и в некоторых случаях не потратить время на поездку к недобросовестному работодателю. '
        'Ожидания, которые Вы озвучите должны соответствовать тем возможностям, которые может предоставить компания, т.е. '
        'Вы ожидаете, что будете реализовывать свой потенциал, выполняя обязанности соответствующие должности в данной компании.',
    'Как долго Вы предполагаете работать в данной компании?',
    'Безусловно, Вы предполагаете проработать в компании как можно дольше. Рассчитываете на то, что у Вас будет возможность '
        'развиваться профессионально и, если должность это подразумевает, расти по карьерной лестнице. При этом Вы понимаете, '
        'что также необходимо познакомится с коллективом и компанией изнутри, на практике понять насколько выполнимы и интересны '
        'поставленные задачи, прежде чем говорить, что Вы готовы работать в компании длительный период времени.',
    'Чем Вас заинтересовала работа именно в данной компании?',
    'Уместно сказать о стабильности компании, ее надежности, известности, предлагаемых перспективах роста и развития сотрудников, '
        'интересной области работы и задачах, предлагаемых условиях. Вы можете назвать несколько критериев, '
        'главное не забывать о том, что они должны соответствовать реальности.',
    'Необходимо помнить при беседе с руководителем/ специалистом по подбору, что все их вопросы направлены на то, чтобы выявить лучшего '
        'специалиста, который готов к продолжительному и плодотворному сотрудничеству. Кроме того Вы как потенциальный сотрудник тоже '
        'можете получить информацию о будущем работодателе анализируя вопросы.',
    'Так если Вам задают много серьезных вопросов относительно Ваших знаний и умений, то попав на работу в данную организацию, '
        'Вы окажитесь среди профессионалов. Если на собеседовании уделяется должное внимание Вам как человеку, то в компании хороший '
        'социально-психологический климат и т.д. В завершение беседы уместно и разумно задать свои вопросы, тем самым Вы покажете, '
        'что заинтересованы в работе, внимательны при выборе будущего работодателя, а задавая вопросы относительно нюансов работы, '
        'сможете дополнительно подчеркнуть квалификацию.',
    'В заключение хочу дать несколько универсальных рекомендаций соискателям, особенно они полезны тем кто не имеет опыта '
        'прохождения собеседований и тем у кого он негативный.',
    'Специалисты по подбору и руководители отдают предпочтение активным, '
        'заинтересованным и мотивированным кандидатам. Поэтому не ждите, пока Вам зададут конкретный вопрос'
        ' по каждому аспекту Вашей работы, не заставляйте интервьюера вытягивать из Вас информацию — это всегда производит '
        'негативное впечатление!',
    'Если Вы сильно волнуетесь, скажите об этом, тем самым Вы создадите небольшую паузу в потоке вопросов, '
        'ситуация немного разрядится, а Вы получите возможность собраться с мыслями и продолжить разговор.',
    'Внимательно слушайте вопрос, который Вам задают (неважно при личной встрече или на этапе еще телефонного разговора). '
        'Нелогичность, хаотичность ответов и невнимательность соискателя нередко становятся причинами того, '
        'что Вас после нескольких минут общения по телефону уже не готовы рассматривать на ту или иную должность. '
        'Если Вы недослышали — переспросите, непонятна суть вопроса — переформулируйте и уточните, правильно ли '
        'Вы поняли то, что хотят от Вас услышать.',
    'В беседе будьте внимательны и доброжелательны, а при ответах — логичны, конкретны и понятны.'
  ];

  static const List<String> preparing_interview_text_more = [
    'Кто-то идёт на собеседование легко, руководствуясь принципом «как будет, так и будет». '
        'Многие воспринимают интервью с рекрутёром как один из самых важных экзаменов, от которого зависит вся будущая жизнь. '
        'Как бы то ни было, раз уж вы собрались на собеседование, значит, его результат вам не безразличен.',
    'А потому неплохо было бы подготовиться к предстоящему интервью. Прежде чем отправиться на собеседование в рекрутинговое агентство, '
        'узнайте, какие вопросы чаще всего задают рекрутёры.',
    '1. Не могли бы вы рассказать о себе?',
    'Главное при ответе — выдержать баланс деловой и личной информации. Упор стоит сделать на свой опыт работы,'
        ' полученное образование, вскользь упомянуть о достижениях (вскользь — потому что вам ещё дадут выговориться на эту тему). '
        'Можно отказаться раскрываться не с профессиональной стороны, но если вы немного расскажете о своих увлечениях, это будет в плюс. '
        'Особенно, если хобби способствуют саморазвитию. Например, вы любите хоккей и регулярно делаете переводы заокеанской прессы в '
        'свой личный блог о «Бостон Брюинз» — это легко подать под соусом «совершенствование английского». Читаете современную литературу? '
        'Отлично, следить за трендами в разных сферах жизни — полезное качество любого кандидата.',
    '2. Какие у вас есть недостатки и слабые стороны?',
    'Тот случай, когда честный ответ сбавит вам баллов. У других претендентов на вакансию тоже есть недостатки, '
        'и если они о своих не расскажут, а вы проявите принципиальность, то ничего хорошего не будет. «Кандидат рассказал, '
        'что немного непунктуален. Учитывая его квалификацию — простительно. Но, может быть, задача ответа — отвлечь внимание от других, '
        'куда более серьёзных недостатков? Не просто же так он легко сознался в том, что регулярно опаздывает», — увы, '
        'многие рекрутеры подумают именно так.',
    'Поэтому отвечайте в стиле «У моих недостатков есть серьёзное достоинство: они никак не сказываются на рабочей деятельности».',
    'Наш совет признайтесь в недостатке, который не очень значителен для должности на которую Вы претендуете. Если бухгалтер скажет, '
        'что он на работе не может себя назвать «душой компании» и не очень многословен ему легко это простят.',
    '3. Какие у вас были достижения на прошлом месте работы?',
    'Неплохо, если серьёзные достижения у вас действительно были. Но даже очень крутые специалисты не должны '
        'пускаться в пространное повествование, похожее на пересказ мифов о Геракле. Выделите основное — скромные, '
        'но знающие себе цену кандидаты котируются высоко.',
    'Работодатели любят достижения в цифрах , поэтому можете сказать что на последнем месте работы 3 раза перевыполняли план на '
        '20% и это будет очень значимо.',
    'Особых достижений нет? Не беда, покопайтесь в памяти: варианты «улучшил свои профессиональные навыки», '
        '«освоил полезную в работе программу» — лучше, чем ничего.',
    '4. Почему вы расстались с прошлым работодателем?',
    'Недопустимо пенять на плохие отношения с коллегами и начальством — вас наверняка примут за конфликтного человека. '
        'Ничтожные перспективы карьерного роста — уважительная причина, но только в том случае, если на новом месте '
        'эти перспективы улучшатся. Уважительной причиной увольнения является переезд офиса в компании в другой район '
        'города или многомесячные задержки заработной платы. В остальном лучше говорить правду. Денежный вопрос упомянуть стоит, '
        'но желательно в самом конце ответа.',
    '5. Какая зарплата вас устроит?',
    'Переходить на новое место с понижением оклада — нонсенс. Поэтому даже если смена работодателя никак '
        'не связана с вашими денежными запросами, стоит назвать цифру выше, чем ваша предыдущая зарплата. '
        'В идеале — на десять-пятнадцать процентов.',
    '6. Как вы видите своё профессиональное будущее через пять лет?',
    'Очень неприятный вопрос для тех, кто планирует в ближайшие годы сменить сферу деятельности '
        'или, обладая серьёзными амбициями, рассчитывает на молниеносное повышение в должности. '
        'Если каких-то конкретных мыслей о профессиональном будущем нет, отвечать также сложно.',
    'Следует исходить из того, что кадровик хочет услышать. А он наверняка будет удовлетворён ответом, '
        'что вы планируете трудиться в той же сфере, хотя не откажетесь помочь компании на более высокой карьерной ступени.',
    '7. Что вы слышали о нашей компании?',
    'Здесь всё просто. Почитайте о новом работодателе, загляните на его сайт. Вариант «Практически ничего не слышал и не знаю, '
        'мне просто нужна большая зарплата» — провальный.',
    '8. Почему вы решили трудоустроиться в нашу компанию?',
    'Поразглагольствуйте немного об их плюсах. «Стать важным элементом в вашей системе, системе лидера отрасли — мой приоритет»,'
        ' «вы подарите мне стабильность — то, что я долго ждал». Отлично будет дополнить основной рассказ бытовыми мелочами: '
        '«Давно хочу снять квартиру в соседнем квартале: там хорошая инфраструктура».',
    'Деньги, как бы они ни были важны, должны появляться в завершающей части ответа: «Кроме того, '
        'небольшое повышение зарплаты мне не повредит».',
    '9. Надолго ли вы к нам пришли?',
    'Высок соблазн сказать, что планируете работать в такой замечательной компании как минимум ближайшие семь лет, '
        'но не торопитесь. Такой ответ выглядит неискренним и может испортить впечатление от собеседования.',
    'Оптимально: «Мне хотелось бы поработать подольше, но многое зависит от того, удастся ли успешно решать '
        'поставленные задачи, смогу ли я реализовать свой потенциал, впишусь ли в коллектив».',
    '10. Способны ли вы выдержать большие нагрузки, согласны ли вы на переработки?',
    'Стоит уточнить, как часто бывают переработки, сколько времени они занимают. Если вас планируют '
        'часто занимать в нерабочее время — уточните, оплачиваются ли сверхурочные. И уже исходя из этих фактов стройте свой ответ.'
  ];

  static const List<String> cv_starter_interview_text_more = [
    'Составляя резюме, вы естественным образом стараетесь показать себя в лучшем свете. '
        'Чтобы будущий работодатель всерьёз заинтересовался таким работником. А агентство по подбору персонала отложило '
        'вашу папку в стопку с пометкой «Самые перспективные»?',
    'Ознакомившись с огромным количеством резюме, мы смогли определить шесть наиболее распространённых ошибок соискателей. '
        'Ознакомьтесь с ними, чтобы ваше резюме было идеальным!',
    '1. Неряшливый, невычитанный текст',
    'Пропуск запятых, неверное использование знаков препинания, орфографические ошибки — лучшего способа показать, '
        'что вам плевать на вакансию, в общем-то, нет. Совершенно не важно, '
        'необходимо ли вам на рабочем месте проявлять знания пунктуации, орфографии и стилистики. '
        'Дело в том, что резюме — это ваше лицо, ваш костюм, ваше всё. '
        'Да, главное — хорошо делать свою работу. Но должность нужно сначала завоевать, '
        'и если раньше соискателя встречали «по одёжке», сейчас, в эру информационных технологий, встречают по резюме. '
        'Просто представьте, что человек приходит на собеседование в мятой пижаме. Доверите ли вы ему серьёзную должность? Не думаем.',
    'Ещё пример. Вы заходите в интернет-магазин и видите, что он торгует смартфонами «Ipone», «Sasung», «Nokiya». '
        'Возникнет ли доверие к такому продавцу? Если он плохо проверил тексты, то наверняка и '
        'к другим своим обязанностям относится халатно, верно?',
    'Обязательно внимательно перечитывайте всё, что отправляете работодателю. '
        'Если правильный русский — ваше проблемное место, пусть поможет друг-филолог. '
        'В крайнем случае, всегда можно найти недорогого корректора или воспользоваться проверкой орфографии программы Word.',
    '2. Неуместное фото',
    'Фотография в резюме — это круто. Вы показываете, что скрывать вам нечего: вот я рассказал о своих навыках и опыте, '
        'а вот я сам, буду рад поработать в хорошей компании. Это подкупает.',
    'Но это не должно быть фото с пляжа в купальнике или с дружеской попойки, фото с игривым выражением лица или недвусмысленной позой. '
        'Чаще всего неуместные фотографии присылают девушки.',
    'Стоит запомнить, что идеальная фотография: это костюм, близкий к классическому, не напряжённая, но и не развязная поза. '
        'И да, фотографироваться нужно в анфас. А бикини или шорты — только для тех, кто проходит кастинг в модельное агентство.',
    '3. Контакты',
    'Работодатель заинтересовался резюме, хочет обсудить условия грядущего сотрудничества, набирает телефонный номер.... '
        'Удивительный факт: на этом этапе отсеивается тоже немало кандидатов. Человек не получает желанное место работы просто потому, '
        'что до него сложно дозвониться. Две-три попытки — и кандидат вычёркивается.',
    'Такого конфуза избежать просто: достаточно написать время, в которое вам удобно принимать звонки и оставить свой e-mail. '
        'Адрес e-mail не должен быть фривольным: SmeshnoyGus11, nimfetka777, ILoveSex666 — крайне неудачные варианты. '
        'Заведите адрес с солидным названием. И не забывайте каждый день проверять почту.',
    '4. Неуместная информация',
    'В этом пункте больше всего проблем бывает при указании образования и опыта. Курсы по дрессировке рыбок не помогут в работе бухгалтера. '
        'А солидный тренерский стаж в болотном футболе не ко двору юридической фирме.',
    'Стоит писать только о том опыте, который вам так или иначе может пригодиться на новом рабочем месте. '
        'Вам наверняка есть чем похвастаться и вне профессиональной сферы, но поберегите человека, '
        'который будет из моря информации выуживать нужную. И помните: если море очень уж большое, процесс ему может надоесть.',
    'Важные данные тоже желательно подавать сжато. Конечно, две-три страницы ваших навыков и достижений — это солидно. '
        'Но если о главном рассказать коротко в самом начале резюме, впечатление будет даже сильнее. Идеальный формат — одна страница.',
    '5. Расплывчатая информация',
    'Пишет, например, соискатель Иванов Иван Иванович: «Семь лет работы на руководящих должностях». '
        'Возникает вопрос: почему без конкретики? Может быть, Иванов много раз менял место работы? Или фирма не указана потому, '
        'что соискатель оставил о себе плохую память? Чем более расплывчата информация, тем сильнее недоверие работодателя.',
    'Чем конкретнее факты, тем лучше. Строчка «Семь лет работал в фирме „Generation Си“ в должности директора по маркетингу» '
        'не вызывает ненужных сомнений и сводит на нет возможность появления негативных трактовок. '
        'Размер компании, её сфера деятельности — это тоже важная информация для многих позиций (от бухгалтеров до управляющего звена). '
        'Работодатели любят когда в резюме указаны измеримые в цифрах достижения.',
    '6. Богатырский замах',
    '«Претендую на должности старшего менеджера, менеджера и директора по продажам» — такое можно написать, '
        'лишь когда сам себе навредить хочешь. Посыл понятен: соискатель хочет быть директором, но если ему предложат должность менеджера, '
        'он не откажется, потому что работа нужна здесь и сейчас. Вот только редко какой компании нужен директор, '
        'амбиции которого удовлетворяются и другой должностью.',
    'Иная ситуация: вы достаточно квалифицированы и разносторонне развиты, чтобы претендовать на несколько должностей, '
        'которые не находятся в подчинении друг у друга. Например, с удовольствием делаете дизайн, но можете работать и копирайтером. '
        'Это допустимо, но стоит разбить резюме на части: пусть дизайн и копирайтинг не путаются.'
  ];
}
