class StringsInterviewUa {
  StringsInterviewUa._();

  static List<String> success_interview_text_more = [
    'Кожному з нас протягом життя необхідно проходити не одну співбесіду, перш ніж вдається знайти роботу, '
        'яка повною мірою відповідатиме потребам і очікуванням і, якою підійдете саме Ви. '
        'Нерідко причиною тривалого пошуку роботи є висока конкуренція на ринку праці і той факт, '
        'що пропозиція значно перевищує попит. Тому важливо вміти «продати» себе як фахівця, особливо для тих, хто '
        'чия робота пов\'язана з регулярним спілкуванням з клієнтами. ',
    'Внаслідок того, що кількість претендентів, які перебувають у пошуку роботи, більша, '
        'чим вакантних посад незалежно від галузі чи посади, фахівці з підбору, '
        'вимушені вигадувати все більш і більш витончені питання, щоб ще на перших етапах'
        '(телефонне інтерв\'ю, співбесіда з менеджером з підбору) відсіяти слабких кандидатів. '
        'Тому далі наше кадрове агентство пропонує розглянути найбільш складні питання для претендентів, '
        'але інформативні для інтерв\'юера.',
    'Поширеним першим питань менеджерів з підбору / керівників є прохання розповісти про себе. '
        'Нерідко людина втрачається, тому що не знає, що хочуть від неї почути, проте це питання вимагає від Вас лише короткої, '
        'але ємної довідки про наступне: ',
    'Ваша освіта, рік закінчення.',
    'Ваш досвід роботи.',
    'Акцент в описі досвіду роботи робиться на тих компаніях та посадах, '
        'які повністю або більшою мірою відповідають посаді, на яку Ви претендуєте у цій компанії. '
        'При цьому від Вас потрібно окреслити коло Ваших обов\'язків та, по можливості, досягнень. '
        'Якщо такого досвіду багато, отримано в різних компаніях, то розкажіть про останні два-три місця роботи або про ті, '
        'Де Ви працювали найбільш тривалий час. Інформація про інші посади, компанії може надаватися, але тезово або у разі, '
        'якщо у Вас незначний профільний досвід.',
    'Інформація щодо кар\'єрного зростання також дається тезово, якщо в інтерв\'юера виникнуть '
        'Питання чи інтерес до конкретного досвіду/ місця роботи, він сам попросить Вас дати розгорнуту відповідь. '
        'Описувати досвід роботи намагайтеся виходячи з тих обов\'язків, які потрібно виконувати на новому місці роботи, '
        'тобто. переформулюйте обов\'язки, зазначені в описі вакансії, співвідносячи зі своїм досвідом.',
    'Завершуючи презентацію свого досвіду, Ви можете пояснити причини пошуку роботи на даний момент. '
        'Якщо у Вас є відчуття, що роботодавець хоче почути від Вас ще щось, а Ви вже все розповіли, '
        'те хорошим завершенням буде сказати про Ваше хобі.',
    'Отримавши коротку і ємну відповідь на прохання розповісти про себе, далі менеджер ставить запитання, '
        'які стосуються найбільш значущих знань, навичок, умінь виконувати конкретні професійні завдання. '
        'Все частіше для прояснення досвіду вирішення трудових завдань менеджери з підбору персоналу використовують кейси,'
        'тобто моделюють робочу ситуацію, дивляться на реакцію, роблять висновки.',
    'Причини відходу з попереднього місця роботи?',
    'Фахівцеві, який проводить відбір, необхідно зрозуміти, що не влаштовувало Вас на колишньому місці і чого очікуєте від нової роботи. '
        'Важливо! Не відгукуйтесь погано про колишнє керівництво, колег, оскільки це негарно і викликає підозру про Ваші здібності '
        'налагоджувати взаємини з колективом. Найбільш прийнятним буде сказати, що Вас не влаштовував графік роботи, '
        'територіальне місце розташування, робота мала рутинний характер, були відсутні перспективи професійного та кар\єрного розвитку. '
        'При цьому краще вибрати один-два фактори, які будуть правдивими, і відсутні в новій компанії.',
    'В останню чергу варто говорити про бажання заробляти більше, даючи зрозуміти потенційному роботодавцю,'
        'Що гроші — це не найголовніше в роботі. Однак, якщо Ви менеджер з продажу, то прийнятно в першу чергу наголошувати '
        'на можливості отримувати більше, тому що Ваше головне завдання приносити в компанію якнайбільше грошей. '
        'Відсутність можливостей у попередній компанії нарощувати обороти з продажу і тим самим свій дохід для багатьох менеджерів '
        'є поважною причиною зміни роботи.',
    'Завершуючи відповідь на це питання, щоб зняти у менеджера по підбору будь-які сумніви у Вашій компетентності, '
        'професіоналізм, неконфліктність і т.д. скажіть, що готові надати рекомендації з останніх місць роботи '
        'від безпосередніх керівників, АЛЕ будьте впевнені, що рекомендації дадуть дійсно позитивні!',
    'Ваші очікування щодо заробітної плати?'
        'Досить успішною є відповідь, що заробітна плата повинна відповідати тим обов\'язкам, які будуть на Вас покладені. '
        'Однак потенційний роботодавець повинен розуміти ти, чи зможе він забезпечити Вас тими доходами, на які Ви претендуєте. '
        'Тому Ви можете позначити дохід на останньому місці роботи як мінімальний, а бажаний вище на 20-30%. '
        'Але не забувайте про те, що Ваші очікування не повинні значно перевищувати ту суму, яку зможе забезпечити нова компанія.',
    'Розкажіть про Ваші недоліки?',
    'Всі люди і у кожного є недоліки. Відповідати чесно на це питання не варто, найкраще ухилиться від відповіді, '
        'Сказавши, що у Вас відсутні недоліки, які заважатимуть Вашій роботі. Або можна відбутися жартами, сказавши, що для '
        'Вас іноді характерно втрачати хід часу, захопившись роботою.',
    'Які досягнення були у Вас на попередній роботі?',
    'Це питання вимагає від Вас знову короткої, але ємної відповіді. Розкажіть про те, що успішно реалізували проект, '
        'привели великого замовника, збільшили обсяг продажу тощо. Можете підкріпити відповідь ілюстрацією найбільшого досягнення, '
        'наприклад, провівши успішні переговори з клієнтом «N» Вам вдалося укласти договір про продаж товарів на суму «Х», '
        'що раніше не вдавалося нікому із співробітників.',
    'Як Ви ставитеся до високоінтенсивної роботи, переробок?;',
    'Для початку уточніть, що саме мається на увазі під даним питанням. Чи доведеться Вам сидіти до півночі або працювати одному '
        'за цілий відділ? Якщо відповідь та умови прийнятні для Вас, то скажіть, що мали досвід роботи в аналогічних умовах, '
        'і успішно справлялися.',
    'Що ви знаєте про нашу компанію і чого очікуєте від роботи?',
    'Якщо Ви йдете на співбесіду безпосередньо до роботодавця, то зобов\'язані заздалегідь переглянути інформацію про нього: '
        'Чим займається компанія, як давно на ринку, переваги і т.д. Пошук інформації заздалегідь не тільки допоможе успішно пройти '
        'Співбесіда, але й у деяких випадках не витратити час на поїздку до недобросовісного роботодавця. '
        'Очікування, які Ви озвучите, повинні відповідати тим можливостям, які може надати компанія, тобто. '
        'Ви очікуєте, що реалізовуватимете свій потенціал, виконуючи обов\'язки відповідні посади в даній компанії.',
    'Як довго Ви припускаєте працювати в даній компанії?',
    'Безумовно, Ви маєте намір пропрацювати в компанії якомога довше. Розраховуєте на те, що Ви матимете можливість '
        'розвиватися професійно і, якщо посада це має на увазі, рости кар\'єрними сходами. При цьому Ви розумієте, '
        'що також необхідно познайомитися з колективом та компанією зсередини, на практиці зрозуміти наскільки здійсненні та цікаві'
        'поставлені завдання, перш ніж говорити, що Ви готові працювати в компанії тривалий період часу.',
    'Чим Вас зацікавила робота саме в даній компанії?',
    'Доречно сказати про стабільність компанії, її надійність, популярність, пропоновані перспективи зростання і розвитку співробітників, '
        'цікавої галузі роботи та задачах, пропонованих умовах. Ви можете назвати кілька критеріїв, '
        'головне не забувати про те, що вони повинні відповідати реальності.',
    'Необхідно пам\'ятати під час розмови з керівником/ фахівцем з підбору, що всі їхні питання спрямовані на те, щоб виявити кращого '
        'фахівця, який готовий до тривалої та плідної співпраці. Крім того, Ви як потенційний співробітник теж '
        'можете отримати інформацію про майбутнього роботодавця аналізуючи питання.',
    'Так якщо Вам ставлять багато серйозних питань щодо Ваших знань та вмінь, то потрапивши на роботу до цієї організації, '
        'Ви опинитеся серед професіоналів. Якщо на співбесіді приділяється належна увага Вам як людині, то в компанії '
        'соціально-психологічний клімат і т.д. На завершення розмови доречно і розумно поставити свої запитання, тим самим Ви покажете, '
        'що зацікавлені в роботі, уважні при виборі майбутнього роботодавця, а ставлячи питання щодо нюансів роботи, '
        'можете додатково підкреслити кваліфікацію.',
    'На закінчення хочу дати кілька універсальних рекомендацій претендентам, особливо вони корисні тим хто не має досвіду'
        'проходження співбесід і тим у кого він негативний.',
    'Фахівці з підбору та керівники віддають перевагу активним, '
        'зацікавленим та мотивованим кандидатам. Тому не чекайте, поки Вам поставить конкретне запитання'
        ' по кожному аспекту Вашої роботи, не змушуйте інтерв\'юера витягувати з Вас інформацію - це завжди робить '
        'негативне враження!',
    'Якщо Ви сильно хвилюєтеся, скажіть про це, тим самим Ви створите невелику паузу у потоці питань, '
        'ситуація трохи розрядиться, а Ви отримаєте можливість зібратися з думками та продовжити розмову.',
    'Уважно слухайте запитання, яке Вам задають (неважливо під час особистої зустрічі або на етапі ще телефонної розмови). '
        'Не логічність, хаотичність відповідей та неуважність претендента нерідко стають причинами того, '
        'що Вас після кількох хвилин спілкування телефоном вже не готові розглядати на ту чи іншу посаду. '
        'Якщо Ви недочули - перепитайте, незрозуміла суть питання - переформулюйте та уточніть, чи правильно '
        'Ви зрозуміли те, що хочуть від Вас почути.',
    'У бесіді будьте уважні та доброзичливі, а при відповідях - логічні, конкретні та зрозумілі.'
  ];

  static List<String> preparing_interview_text_more = [
    'Хтось йде на співбесіду легко, керуючись принципом «як буде, так і буде». '
        'Багато хто сприймає інтерв\'ю з рекрутером як один з найважливіших іспитів, від якого залежить все майбутнє життя. '
        'Як би там не було, якщо ви зібралися на співбесіду, значить, його результат вам не байдужий.',
    'А тому непогано було б підготуватися до майбутнього інтерв\'ю. Перш ніж вирушити на співбесіду до рекрутингової агенції, '
        'дізнайтеся, які питання найчастіше ставлять рекрутери.',
    '1. Чи не могли б ви розповісти про себе?',
    'Головне при відповіді — витримати баланс ділової та особистої інформації. Наголос варто зробити на свій досвід роботи,'
        ' отримана освіта, мимохіть згадати про досягнення (побіжно - тому що вам ще дадуть виговоритися на цю тему). '
        'Можна відмовитися розкриватися не з професійного боку, але якщо ви трохи розповісте про свої захоплення, це буде плюс. '
        'Особливо, якщо хобі сприяють саморозвитку. Наприклад, ви любите хокей і регулярно робите переклади заокеанської преси в '
        'свій особистий блог про "Бостон Брюїнз" - це легко подати під соусом "вдосконалення англійської". Читаєте сучасну літературу? '
        'Відмінно, стежити за трендами в різних сферах життя - корисна якість будь-якого кандидата.',
    '2. Які у вас є недоліки та слабкі сторони?',
    'Той випадок, коли чесна відповідь зменшить вам балів. Інші претенденти на вакансію теж мають недоліки, '
        'І якщо вони про своїх не розкажуть, а ви виявите принциповість, то нічого доброго не буде. «Кандидат розповів, '
        'Що трохи непунктуальний. З огляду на його кваліфікацію — можна пробачити. Але, можливо, завдання відповіді - відвернути увагу від інших, '
        'Куди серйозніші недоліки? Не просто так він легко зізнався в тому, що регулярно спізнюється», - на жаль, '
        'багато рекрутерів подумають саме так.',
    'Тому відповідайте в стилі «У моїх недоліків є серйозна гідність: вони ніяк не позначаються на робочій діяльності».',
    'Наша порада зізнайтеся в недоліку, який не дуже значний для посади, на яку Ви претендуєте. Якщо бухгалтер скаже, '
        'що він на роботі не може себе назвати "душою компанії" і не дуже багатословний йому легко це пробачать.',
    '3. Які у вас були досягнення на минулому місці роботи?',
    'Непогано, якщо серйозні досягнення у вас справді були. Але навіть дуже круті фахівці не повинні '
        'пускатися в розлогу розповідь, схожу на переказ міфів про Геракла. Виділіть основне - скромні, '
        'але знаючі собі ціну кандидати котируються високо.',
    'Роботодавці люблять досягнення в цифрах, тому можете сказати що на останньому місці роботи 3 рази перевиконували план на '
        '20% і це буде дуже значуще.',
    'Особливих досягнень немає? Не біда, покопайтеся в пам\'яті: варіанти «поліпшили свої професійні навички», '
        '«освоїв корисну в роботі програму» - краще, ніж нічого.',
    '4. Чому ви розлучилися з минулим роботодавцем?',
    'Неприпустимо нарікати на погані стосунки з колегами та начальством — вас напевно приймуть за конфліктну людину. '
        "Ніщо перспективи кар'єрного зростання - поважна причина, але тільки в тому випадку, якщо на новому місці"
        'Ці перспективи покращаться. Поважною причиною звільнення є переїзд офісу в компанії до іншого району.'
        'міста або багатомісячні затримки заробітної плати. В іншому краще говорити правду. Грошовий питання згадати варто, '
        'але бажано наприкінці відповіді.',
    '5. Яка зарплата вас влаштує?',
    'Переходити на нове місце зі зниженням окладу - нонсенс. Тому навіть якщо зміна роботодавця ніяк'
        'не пов\'язана з вашими грошовими запитами, варто назвати цифру вищою, ніж ваша попередня зарплата. '
        'В ідеалі - на десять-п\'ятнадцять відсотків.',
    '6. Як ви бачите своє професійне майбутнє через п\'ять років?',
    'Дуже неприємне питання для тих, хто планує найближчими роками змінити сферу діяльності '
        'Ти, маючи серйозні амбіції, розраховує на блискавичне підвищення на посаді. '
        'Якщо якихось конкретних думок про професійне майбутнє немає, відповідати також складно.',
    'Слід виходити з того, що кадровик хоче почути. А він, напевно, буде задоволений відповіддю, '
        'що ви плануєте працювати в тій же сфері, хоча не відмовитеся допомогти компанії на вищому кар\'єрному щаблі.',
    '7. Що ви чули про нашу компанію?',
    'Тут все просто. Почитайте про нового роботодавця, завітайте на його сайт. Варіант «Практично нічого не чув і не знаю, '
        'Мені просто потрібна велика зарплата" - провальний.'
        '8. Чому ви вирішили працевлаштуватись у нашу компанію?',
    'Поговоріть трохи про їхні плюси. «Стати важливим елементом у вашій системі, системі лідера галузі — мій пріоритет»',
    ' «ви подаруєте мені стабільність - те, що я долго чекав». Відмінно буде доповнити основне оповідання побутовими дрібницями: '
        '«Давно хочу зняти квартиру в сусідньому кварталі: там хороша інфраструктура».',
    'Гроші, як би вони не були важливими, повинні з\'являтися в завершальній частині відповіді: «Крім того, '
        'невелике підвищення зарплати мені не зашкодить».',
    '9. Чи надовго ви прийшли до нас?',
    'Висока спокуса сказати, що плануєте працювати в такій чудовій компанії як мінімум найближчі сім років, '
        'Але не поспішайте. Така відповідь виглядає нещирою і може зіпсувати враження від співбесіди.',
    'Оптимально: «Мені хотілося б попрацювати довше, але багато залежить від того, чи вдасться успішно вирішувати'
        'поставлені завдання, чи зможу я реалізувати свій потенціал, чи впишуся в колектив».',
    '10. Чи здатні ви витримати великі навантаження, чи згодні ви на переробки?',
    'Варто уточнити, як часто бувають переробки, скільки часу вони займають. Якщо вас планують '
        'Часто займати в неробочий час - уточніть, чи оплачуються понаднормові. І вже виходячи з цих фактів будуйте свою відповідь.'
  ];

  static List<String> cv_starter_interview_text_more = [
    'Складаючи резюме, ви природно намагаєтеся показати себе в кращому світлі. '
        'Щоб майбутній роботодавець всерйоз зацікавився таким працівником. А агентство з підбору персоналу відклало '
        'вашу папку в стопку з позначкою «Найперспективніші»?',
    'Ознайомившись з величезною кількістю резюме, ми змогли визначити шість найпоширеніших помилок претендентів. '
        'Ознайомтеся з ними, щоб ваше резюме було ідеальним!',
    '1. Неохайний, невичитаний текст',
    'Пропуск ком, неправильне використання розділових знаків, орфографічні помилки — кращого способу показати, '
        'Що вам плювати на вакансію, загалом, немає. Цілком не важливо, '
        'Чи потрібно вам на робочому місці виявляти знання пунктуації, орфографії та стилістики. '
        'Справа в тому, що резюме - це ваше обличчя, ваш костюм, ваше все. '
        'Так, головне — добре робити свою роботу. Але посаду потрібно спочатку завоювати, '
        'І якщо раніше здобувача зустрічали «по одязі», зараз, в еру інформаційних технологій, зустрічають по резюме. '
        'Просто уявіть, що людина приходить на співбесіду в м\'ятій піжамі. Чи довірите йому серйозну посаду? Не думаємо.',
    'Ще приклад. Ви заходите в інтернет-магазин і бачите, що він торгує смартфонами "Ipone", "Sasung", "Nokiya". '
        'Чи виникне довіра до такого продавця? Якщо він погано перевірив тексти, то, напевно, і '
        'до інших своїх обов\'язків ставиться недбало, вірно?',
    'Обов\'язково уважно перечитуйте все, що ви відправляєте роботодавцю. '
        'Якщо правильна російська — ваше проблемне місце, нехай допоможе друг-філолог. '
        'У крайньому випадку завжди можна знайти недорогого коректора або скористатися перевіркою орфографії програми Word.',
    '2. Недоречне фото',
    'Фотографія в резюме — це круто. Ви показуєте, що приховувати вам нічого: ось я розповів про свої навички та досвід, '
        'Та ось я сам, радий попрацювати в хорошій компанії. Це підкуповує.',
    'Але це не повинно бути фото з пляжу в купальнику або з дружньої пиятики, фото з грайливим виразом обличчя або недвозначною позою. '
        'Найчастіше недоречні фотографії надсилають дівчата.',
    'Варто запам\'ятати, що ідеальна фотографія: це костюм, близький до класичного, не напружена, але й не розв\'язна поза. '
        'І так, фотографуватися потрібно в анфас. А бікіні чи шорти — лише для тих, хто проходить кастинг у модельну агенцію.',
    '3. Контакти',
    'Роботодавець зацікавився резюме, хоче обговорити умови майбутньої співпраці, набирає телефонний номер.... '
        'Дивовижний факт: на цьому етапі відсівається теж чимало кандидатів. Людина не отримує бажане місце роботи просто тому, '
        'Що до нього складно додзвонитися. Дві-три спроби — і кандидат викреслюється.',
    'Такого конфузу уникнути просто: достатньо написати час, у який вам зручно приймати дзвінки та залишити свій e-mail. '
        'Адреса e-mail не повинна бути фривольною: SmeshnoyGus11, nimfetka777, ILoveSex666 — вкрай невдалі варіанти. '
        'Заведіть адресу із солідною назвою. І не забувайте щодня перевіряти пошту.',
    '4. Недоречна інформація',
    'У цьому пункті найбільше проблем буває при вказівці освіти та досвіду. Курси з дресирування рибок не допоможуть у роботі бухгалтера. '
        'А солідний тренерський стаж у болотному футболі не до двору юридичній фірмі.',
    'Варто писати тільки про той досвід, який вам так чи інакше може стати в нагоді на новому робочому місці. '
        'Вам напевно є чим похвалитися і поза професійною сферою, але побережіть людину, '
        'Який з моря інформації вивужуватиме потрібну. І пам\'ятайте: якщо море дуже велике, процес йому може набриднути.',
    'Важливі дані теж бажано подавати стисло. Звичайно, дві-три сторінки ваших навичок та досягнень – це солідно. '
        'Але якщо про головне розповісти коротко на самому початку резюме, враження буде навіть сильнішим. Ідеальний формат — одна сторінка.',
    '5. Розпливчаста інформація',
    'Пише, наприклад, здобувач Іванов Іван Іванович: “Сім років роботи на керівних посадах”. '
        'Виникає питання: чому без конкретики? Можливо, Іванов багато разів змінював місце роботи? Або фірма не вказана тому',
    'Що здобувач залишив про себе погану пам\'ять? Чим більш розпливчаста інформація, тим сильніша недовіра роботодавця.',
    'Чим конкретніші факти, тим краще. Рядок «Сім років працював у фірмі „Generation Сі“ на посаді директора з маркетингу» '
        'не викликає непотрібних сумнівів і зводить нанівець можливість появи негативних трактувань. '
        'Розмір компанії, її сфера діяльності - це теж важлива інформація для багатьох позицій (від бухгалтерів до ланки, що управляє). '
        'Роботодавці люблять коли в резюме вказані вимірні в цифрах досягнення.',
    '6. Богатирське замах',
    '«Претендую на посади старшого менеджера, менеджера та директора з продажу» — таке можна написати, '
        'Тільки коли сам собі нашкодити хочеш. Посилання зрозуміле: претендент хоче бути директором, але якщо йому запропонують посаду менеджера, '
        'Той не відмовиться, бо робота потрібна тут і зараз. Ось тільки рідко якій компанії потрібен директор, '
        'амбіції якого задовольняються й іншою посадою.',
    'Інша ситуація: ви достатньо кваліфіковані та різнобічно розвинені, щоб претендувати на кілька посад, '
        'Ті, хто не підпорядкований один одному. Наприклад, із задоволенням робите дизайн, але можете працювати і копірайтером. '
        'Це припустимо, але варто розбити резюме на частини: нехай дизайн та копірайтинг не плутаються.'
  ];
}
