class StringsRu {
  StringsRu._();


  // sign in and registration item

  static const String empty_text = 'Пожалуйста введите текст';
  static const String name = 'Имя';
  static const String enter_name = 'Введите имя';
  //Strings new strings ----------------------------------------------------------

  static String employee_agency = 'КАДРОВОЕ АГЕНТСТВО';
  static String send_message_form = 'Отправить';
  static String send_message_form_call = 'Заказать звонок';
  static String recruiting_for_best = 'Рекрутинговая компания для лучших';
  static String success_message_start = 'СПАСИБО ЗА ВАШУ ЗАЯВКУ';
  static String success_message_end =
      'наш специалист свяжется с вами в ближайшее время!';

  //Strings Article ------------------------------------------------------------
  static String article_text = 'СТАТЬИ ДЛЯ СОИСКАТЕЛЕЙ';

  static String success_interview_text =
      'УСПЕШНОЕ СОБЕСЕДОВАНИЕ ИЛИ КАК ОТВЕТИТЬ НА КОВАРНЫЕ ВОПРОСЫ';

  static String preparing_for_interview_text =
      'ГОТОВИМСЯ К СОБЕСЕДОВАНИЮ. ДЕСЯТЬ ТИПИЧНЫХ ВОПРОСОВ РЕКРУТЕРОВ';

  static String cv_starter_interview_text =
      'КАК НЕ ИСПОРТИТЬ РЕЗЮМЕ? ШЕСТЬ ОШИБОК СОИСКАТЕЛЯ';


  //call us Page --------------------------------------------------------------------
  static String call = 'Позвонить';
  static String contact_page_text = 'СВЯЗАТЬСЯ С НАМИ';
  static String contact_page_finder_1 = 'C нами вы сможете:';
  static List<String> contact_page_finder_1_more = [
    'определить потенциал сотрудников;',
    'определить уровень компетенции действующих сотрудников;',
    'оценить достижения специалистов и размер их вознаграждений;',
    'повысить качество управления персоналом;',
    'создать кадровый резерв для руководящих должностей;',
    'развить корпоративную культуру.'
  ];

  //Strings Double Text Button -------------------------------------------------
  static String hr_consulting_page_text = 'КАДРОВЫЙ HR-КОНСАЛТИНГ';
  static String hr_consulting_page_offer = 'Мы поможем вам:';
  static List<String> hr_consulting_page_offer_more = [
    'Раскрыть потенциал компании',
    'Освободить личное время для стратегических задач',
    'Построить управление коллективом более эффективно',
    'Инвестировать в главный ресурс компании - персонал'
  ];

  static String hr_consulting_page_finder_1 = 'Зачем нужен HR-консалтинг?';
  static List<String> hr_consulting_page_finder_1_more = [
    'Одним из ключевых направлений деятельности компании HR-Library является консультирование в области менеджмента человеческими ресурсами.',
    'Кадровый консалтинг помогает построить эффективную систему руководства коллективом для увеличения эффективности его работы. '
        'HR консалтинг ориентирован, прежде всего, на помощь компаниям в достижении их целей и реализации идей, '
        'которые требуют повышения эффективности работы с персоналом.',
    'У нашей компании накоплен не только опыт в этой области, но и база специализированных знаний. '
        'Наши консультанты – действующие HR-специалисты с немалым опытом решения сложных управленческих задач.'
  ];

  static String hr_consulting_page_finder_2 =
      'КАДРОВЫЙ КОНСАЛТИНГ И АУДИТ ПОЗВОЛЯТ ВАМ:';
  static List<String> hr_consulting_page_finder_more_2 = [
    'Увеличить прибыльность от персонала и его отдачу',
    'Снизить ротацию персонала в компании',
    'Усилить корпоративную приверженность',
    'Улучшить показатели эффективности',
    'Сократить персонал без потерь производительности',
    'Создать планы развития корпоративной культуры и менеджмента',
    'Разрешить любые конфликты в коллективе, снижающие эффективность',
    'Удержать ключевых сотрудников, которые важны для бизнеса'
  ];

  // OutStaffing Page ----------------------------------------------------------
  static String out_staffing_text = 'АУТСТАФФИНГ ПЕРСОНАЛА';
  static String out_staffing_offer = 'Этапы вывода сотрудников за штат:';
  static List<String> out_staffing_offer_more = [
    'Подача заявки',
    'Анализ',
    'Договор',
    'Трудоустройство',
    'Расчет',
    'Работаем!'
  ];

  static String out_staffing_finder_1 = 'Что такое аутстаффинг?';
  static List<String> out_staffing_finder_1_more = [
    'Аутстаффинг («вывод за штат») — временный перевод персонала из штата одной компании в другую.',
    'Сотрудники работают при этом на своих местах, сохранив те же функции и обязанности, что и раньше. '
        'Но их работодателем уже выступает компания-аутстаффер. Юридическая и фактическая ответственность '
        'за каждого выведенного за штат человека возлагается теперь на неё.'
  ];

  static String out_staffing_finder_2 =
      'Чем отличается аутсорсинг от аутстаффинга??';
  static List<String> out_staffing_finder_2_more = [
    'В обоих случаях речь идёт о привлечении к работе сторонних сотрудников. '
        'И хотя схожесть этих понятий этим и ограничивается, многие их нередко путают.',
    'При аутсорсинге персонала внештатный персонал выполняет для заказчика какой-либо определённый процесс или этап работ, '
        'входящих в крупный проект.',
    'При аутстаффинге заказчик получает персонал в своё распоряжение на оговоренное время и сам организует его работу.',
    'Например, вы хотите, чтобы чистоту в офисе поддерживали внештатные сотрудники.',
    'Вариант первый: вы заключаете с компанией договор, согласно которого по окончании рабочего дня в офисе должны быть вымыты полы, '
        'а в течение дня, скажем трижды, собран весь мусор и протёрта пыль. Плюс каждую пятницу – вымыты окна.',
    'Компания направляет к вам сотрудников, которые исполняют все эти работы. Число сотрудников определяет компания, '
        'и задачу им ставит также она. Это — аутсорсинг.',
    'Вариант второй: вы заключаете договор, согласно которого компания направляет в ваше распоряжение уборщицу или несколько '
        'уборщиц с 9 утра до 18 вечера с понедельника по пятницу. Вы ставите уборщице задачу: '
        'в конце дня вымыть пол, а в течение дня не реже трёх раз протереть пыль и вынести мусор, '
        'а по пятницам вымыть окна. Это — аутстаффинг.'
  ];

  // Employee data Page --------------------------------------------------------

  static String employee_data_page_text = 'БЕСПЛАТНАЯ БАЗА РЕЗЮМЕ СОИСКАТЕЛЕЙ';
  static String employee_data_page_offer = 'Наши преимущества';
  static List<String> employee_data_page_offer_more = [
    'Мы ищем везде, а не на двух сайтах',
    'Резюме подбираются исключительно экспертами по подбору персонала',
    'Мы работаем очень оперативно от 12 до 24 часов',
    'Резюме подбираются строго по Вашей заявке',
    'Мы имеем собственную базу актуальных резюме',
    'Мы подбираем целевые резюме по Вашей вакансии с платных сайтов'
  ];

  static String employee_data_page_finder_1 = 'КАК ЭТО РАБОТАЕТ:';
  static List<String> employee_data_page_finder_1_more = [
    'Вы заказывайте бесплатный звонок эксперта',
    'Эксперт отвечает на Ваши вопросы и Вы сообщаете ему требования к кандидатам',
    'Вы производите оплату услуги и мы направляем резюме на ваш электронный адрес'
  ];

  static String employee_data_page_finder_2 = 'Поиск резюме';
  static List<String> employee_data_page_finder_2_more = [
    'Подбор персонала силами профессиональных экспертов рекрутинговой компании;',
    'Сокращение издержек на покупку доступа job сайтов;',
    'Оперативная оценка реальной ситуацию на рынке труда и рекомендации по изменению мотивации сотрудников;',
    'Скорость работы - первые резюме Вы получаете в день обращения;',
    'Вы сэкономите огромное количество времени не перебирая тысячи резюме.'
  ];

  //Scan CV PAGE ---------------------------------------------------------------
  static String scan_cv_page_text = 'СКРИНИНГ РЕЗЮМЕ';
  static String scan_cv_page_offer =
      'Поиск осуществляется по таким характеристикам соискателя должности:';
  static List<String> scan_cv_page_offer_more = [
    'Возраст',
    'Пол',
    'Образование',
    'Специальность',
    'Опыт работы'
  ];

  static String scan_cv_page_finder_1 = 'Наши услуги';
  static List<String> scan_cv_page_finder_1_more = [
    'Получите лучшие и самые актуальные резюме кандидатов',
    'Сократите издержки компании и не ищите резюме соискателей сами',
    'Пользуйтесь услугами рекрутеров и консультантов для поиска работников по базе резюме',
    'Выберите своего сотрудника из большого чиста специалистов',
    'Просто ставьте сроки и задачи и получайте результат – список резюме соискателей!'
  ];
  static String scan_cv_page_finder_2 = 'Скрининг резюме персонала';
  static List<String> scan_cv_page_finder_2_more = [
    'Более низкая стоимость по сравнению с рекрутингом',
    'Экономия времени',
    'Оплата осуществляется не за одного соискателя, а в целом за вакансию',
    'Экономия средств на покупке доступов к нескольким платным ресурсам'
  ];

  //Strings Research Page ------------------------------------------------------
  static String research_page_text = 'ЭКСПРЕСС-ПОДБОР ПЕРСОНАЛА';
  static String research_page_offer = 'Экономим время и деньги:';
  static List<String> research_page_offer_more = [
    'на первичный поиск кандидатов;',
    'на телефонные звонки соискателям;',
    'на обработку входящих резюме;',
    'на отбор кандидатов;',
    'на запрос рекомендаций.'
  ];

  static String research_page_finder_1 = 'Экспресс-подбор персонала';
  static List<String> research_page_finder_1_more = [
    'Помогаем вам сформулировать требования к резюме и личным качествам кандидатов, а также сформулировать интересные им условия.',
    'Отбираем специалистов, которые соответствуют списку требований.',
    'Связываемся по телефону с каждым, информирует о свободной вакансии, проводим краткое интервью.',
    'Резюме заинтересованных кандидатов направляем вам.',
    'Заинтересованные кандидаты приглашаются на собеседование в ваш офис.',
    'Рекрутер нашего кадрового агентства проверяет рекомендации от предыдущего руководителя финального кандидата',
    'Ресечинг позволяет назначить удобное время для проведения собеседований, '
        'грамотно распределить время и избежать незапланированных простоев.'
  ];

  static String research_page_finder_2 = 'Преимущества ресечинга';
  static List<String> research_page_finder_2_more = [
    'Используем как собственную базу, так и не менее 7 открытых и закрытых интернет-ресурсов по поиску специалистов.',
    'Гарантируем вам достоверность информации, заявленной в резюме кандидатов.',
    'Обеспечиваем полную конфиденциальность – наши специалисты не используют полученные сведения о компании в личных целях.',
    'Применяем современные методы исследований и интервью, позволяющие успешно решать кадровые задачи любой сложности.',
    'Расчет осуществляется после того как 7 дней кандидат или кандидаты работают у вас.'
  ];

  //Strings ABOUT US PAGE ------------------------------------------------------
  static String about_us_text = 'О компании';
  static List<String> about_us_text_more = [
    'Кадровое агентство HR-Library работает на рынке услуг по подбору персонала. '
        'За нашей деятельностью стоит немалый опыт. Мы не только наблюдали за становлением рекрутинга как отрасли, '
        'но стали активными участниками этого процесса.',
    'Мы помогли многим компаний решить проблему с комплектацией штата, а кандидатам - найти стабильное место трудоустройства.'
        'Мы не сбавляли нашей активности и темпа развития даже в трудные периоды экономических кризисов и на сегодняшний день являемся '
        'признанными экспертами по подбору персонала.',
    'Оказываем компаниям и организациям следующие услуги:'
        'поиск сотрудников на новые должности;',
    'замена специалиста, обновление штата;',
    'открытие новых филиалов, в том числе, в регионах;',
    'консультирование по HR вопросам и оценке персонала.',
    'HR-Library осуществляет поиск персонала ведет активную работу с работодателями и кандидатами.'
  ];

  static String about_us_for_people = 'Для кого мы работаем';
  static List<String> about_us_for_people_more = [
    'Клиентами HR-LIBRARY являются как солидные компании с многочисленным штатом, '
        'так и развивающиеся компании, формирующие команду. Наше агентство имеет опыт работы в разных сферах бизнеса - IT, '
        'строительство, логистика, продажи, производство и другие направления.',
    'К нашим услугам работодатели прибегают как в стандартных, так и в экстренных ситуациях подбора, '
        'когда персонал нужен "здесь и сейчас". Оперативность без потери качества - один из основных принципов нашей работы.'
  ];

  static String about_us_five = '5 принципов нашей работы';
  static List<String> about_us_five_more = [
    '1. Специализация по направлениям',
    '2. Широкий охват кандидатов',
    '3. Тщательное тестирование и проверка безопасности',
    '4. Работа на результат',
    '5. Тройная гарантия'
  ];

  //String Sales Manager page -------------------------------------------------
  static String sales_manager_text = 'ПОДБОР ПЕРСОНАЛА В СФЕРЕ ПРОДАЖ';
  static String sales_manager_offer_work_1 = 'Резюме по категориям:';
  static String sales_manager_offer_work_2 = 'Подбор сотрудников:';
  static List<String> sales_manager_offer_work_1_more = [
    'резюме менеджера по продажам',
    'резюме руководителя по продажам',
    'резюме начальника отдела продаж',
    'резюме торгового представителя',
    'резюме коммерческого директора',
    'резюме директора по продажам'
  ];
  static List<String> sales_manager_offer_work_2_more = [
    'коммерческий директор',
    'руководитель отдела продаж',
    'менеджер по продажам',
    'менеджер по работе с клиентами',
    'директор по продажам',
    'торговый представить'
  ];

  static String sales_manager_finder = 'Подбор в сфере продаж';
  static List<String> sales_manager_finder_more = [
    'Главное в продажах – это результат. Если Вам требуется менеджер по продажам, '
        'мы подберем наиболее эффективных и результативных сотрудников.',
    'Оценке и проверке подвергаются профессиональные качества и навыки, результативность на предыдущих местах работы, личные качества.',
    'Как мы это делаем?',
    'Используем собственную базу кандидатов в сфере продаж. Мы имеем большую базу резюме, '
        'среди которых резюме торгового представителя, резюме руководителя отдела продаж, резюме коммерческого директора и другие.',
    'Оцениваем навыки продаж, профессионально важные качества, моделируя типовые рабочие задачи (например – работа с возражениями).',
    'Лично встречаемся с работодателем для большего понимания задач подбора специалиста.',
    'Ищем кандидатов по большому количеству источников, в том числе и у Ваших профессиональных конкурентов'
  ];

  static String sales_manager_finder_2 = 'Почему нам доверяют?';
  static List<String> sales_manager_finder_2_more = [
    'Скорость подбора сотрудника – всегда актуальная база резюме специалистов.',
    'Четкое соответствие ожиданиям – с точки зрения опыта, профессионализма и личностных характеристик.',
    'Поиск менеджера по продажам, подбор и оценка специалистов в сфере продаж – это наша главная специализация.',
    'Отлаженная система рекрутинга обеспечивает оперативный подбор самых профессиональных и результативных специалистов.',
    'Тройная гарантия результата – оплата только за 100% результат!'
  ];

  // Advertising Page ---------------------------------------------------------
  static String advertising_text =
      'ПОДБОР ПЕРСОНАЛА В СФЕРЕ МАРКЕТИНГА И РЕКЛАМЫ';
  static String advertising_offer_work_1 = 'Мы ищем следующих специалистов:';
  static List<String> advertising_offer_work_1_more = [
    'Аналитик;',
    'Директор по маркетингу;',
    'Маркетолог;',
    'Бренд-менеджер;',
    'Директор по рекламе;',
    'Менеджер по рекламе;',
    'Интернет-маркетолог;',
    'Event-менеджер;',
    'Контент-менеджер;',
    'Копирайтер;',
    'Менеджер по PR;',
    'PR директор.'
  ];
  static String advertising_offer_work_2 = 'Мы подбираем персонал:';
  static List<String> advertising_offer_work_2_more = [
    'В департаменты маркетинга в составе компаний;',
    'В рекламные агентства;',
    'В маркетинговые агентства;',
    'В Digital-маркетинговые агентства;',
    'В рекламные и PR отделы организаций.'
  ];

  static String advertising_finder_1 =
      'Персонал для отдела рекламы и маркетинга';
  static List<String> advertising_finder_1_more = [
    'Одна из специализаций рекрутингового агентства HR-Library – подбор сотрудников в сфере маркетинга, рекламы и PR.',
    'Даем тройную гарантию, что предоставленные кандидаты будет соответствовать заявленным требованиям и '
        'конкретным задачам бизнеса вашего агентства и/или отдела.'
  ];
  static String advertising_finder_2 = 'Как мы ищем и подбираем специалистов?';
  static List<String> advertising_finder_2_more = [
    'Первичный отбор.',
    'Предварительный анализ резюме соискателей на их соответствие требованиям компании-работодателя '
        'и формировании списка кандидатов. При этом отсеиваются специалисты, которые не обладают минимальным набором требуемых качеств.',
    'Собеседование с кандидатом.',
    'При беседе оцениваются его компетенции, мотивация, стремление к профессиональному росту, умение адаптироваться в новом коллективе и др. '
        'Каждому соискателю предоставляется объективная информация о работодателе, условиях работы, размерах оплаты, '
        'что позволяет объективно замотивировать кандидата.',
    'Проверка рекомендаций.',
    'Для получения объективной информации о личных и профессиональных качествах специалиста проводится беседа с руководителем, '
        'способным его охарактеризовать с профессиональной точки зрения, с сотрудниками организаций, в которых он ранее трудился.',
    'Прием на работу.',
    'На основе аналитических данных отбирается кандидат, максимально подходящий на вакантную должность. '
        'С ним заключается договор в письменной форме и назначается испытательный срок для проверки его трудовых и профессиональных навыков. '
        'На испытательном сроке действует гарантия от HR-Library.'
  ];

  // Top Manager Page ---------------------------------------------------------

  static String top_manager_text = 'ПОДБОР ТОП-ПЕРСОНАЛА';
  static List<String> top_manager_work_1_more = [
    'Продажи / Сфера торговли / Закупки / ВЭД',
    'Бухгалтерия / Финансы / Банки',
    'Реклама / Маркетинг / PR',
    'Проектирование / Строительство / Архитектура',
    'Промышленность / Производство',
    'Юриспруденция',
    'Информационные технологии / Телекоммуникации',
    'Транспорт / Логистика',
  ];
  static List<String> top_manager_work_2_more = [
    'Топ-персонал;',
    'Генеральный директор;',
    'Исполнительный директор;',
    'Операционный директор;',
    'Заместитель директора;',
    'Директор по общим вопросам;',
    'и др.'
  ];

  static String top_manager_finder = 'Поиск руководителей';
  static List<String> top_manager_finder_more = [
    'Если вам требуется успешный руководитель из конкретного сегмента рынка обращайтесь в кадровое агентство HR-Library.',
    'Требования заказчика к агентству по подбору руководящего персонала чрезвычайно высоки. '
        'И это объяснимо, ведь топ-менеджеры олицетворяют стратегию и политику компании. '
        'Очевидно, что подбор "топов" в компанию — задача непростая и ответственная.',
    'Вы можете выдвинуть любые требования и пожелания к кандидату, как профессионального, так и личностного характера. '
        'Можете быть уверены, что все они будет учтены нами в процессе подбора.'
  ];
  static String top_manager_finder_2 = 'Этапы подбора руководящего персонала:';
  static List<String> top_manager_finder_2_more = [
    'Первоначальный подбор, тщательный анализ соискателей;',
    'Применение технологии прямого поиска;',
    'Составление списка кандидатов, отвечающих всем критериям;',
    'Предоставление списка заказчику с последующим выбором наиболее подходящих соискателей;',
    'Организация собеседования с кандидатами, в котором могут принимать участие и наши сотрудники;',
    'По результатам собеседования заказчик выбирает специалиста;',
    'Сотрудничество с нашим кадровым агентством по подбору руководителей станет для вас удобным, конфиденциальным и продуктивным!'
  ];

  //Administration Page --------------------------------------------------------
  static String administration_text =
      'ПОДБОР СЕКРЕТАРЕЙ И АДМИНИСТРАТИВНОГО ПЕРСОНАЛА';
  static String administration_work_offer =
      'Мы специализируемся на подборе секретарей, а также поможем, если нужен:';
  static List<String> administration_work_offer_more = [
    'Администратор',
    'Офис-менеджер',
    'Личный помощник',
    'Персональный ассистент',
    'Бизнес-ассистент',
    'Помощник руководителя'
  ];

  static String administration_finder_1 = 'Нужен администратор?';
  static List<String> administration_finder_1_more = [
    'Для того чтобы оперативно предложить вам полностью подходящего специалиста как только мы узнаем, что вам требуется секретарь, мы:',
    'Поддерживаем базу резюме секретарей и личных помощников',
    'Непрерывно просматриваем новые резюме офис-менеджеров, секретарей, операторов ПК и других специалистов по административной работе',
    'Постоянно проводим собеседования с новыми потенциальными кандидатами, оценивая рабочие навыки и знание компьютерных '
        'программ проверяя информацию из резюме и рекомендации, проводя психологическое тестирование и моделируя реальные рабочие задачи',
    'В результате сразу же после вашего обращения с заявкой на подбор секретарей, мы:',
    'Лично встречаемся с вами, чтобы четко понять, какого именно специалиста вы ищете',
    'Предоставляем широкий выбор самых достойных кандидатов',
    'Даем гарантию – в случае ухода сотрудника мы оперативно подберем для вас нового специалиста бесплатно',
    'Важно обращать внимание не только на опыт и навыки при поиске секретарей, '
        'поэтому узнайте больше о подборе секретаря – просто закажите звонок!'
  ];

  static String administration_finder_2 = 'Кто вам нужен?';
  static List<String> administration_finder_2_more = [
    'Очень часто под запросом «ищу секретаря» руководители на самом деле скрывают поиск опытного администратора, '
        'который возьмет на себя хозяйственную часть жизни всего офиса, говоря «ищу секретаря в офис», держат в голове личного помощника, '
        'который будет оставаться на связи круглосуточно, а формулируя вакансию как «требуется секретарь с дополнительными '
        'обязанностями» имеют ввиду уникальное сочетание системного администратора, оператора пк, коммерческого директора, офис-менеджера '
        'и специалиста по продажам.',
    'К счастью, опытные специалисты HR-Library точно смогут разобраться, что именно вы понимаете под запросом «нужен администратор», '
        'и подберут для вас того самого специалиста, который точно справится со всеми возлагаемыми на него обязанностями.',
    'Мы готовы приступить к работе прямо сейчас!'
  ];

  //HR Page new ----------------------------------------------------------------
  static String hr_page_text =
      'ПОДБОР СПЕЦИАЛИСТОВ В СФЕРЕ УПРАВЛЕНИЯ ПЕРСОНАЛОМ';
  static List<String> hr_page_offer_more_1 = [
    'HR-директор;',
    'Менеджер по персоналу (эйчар);',
    'Тренинг-менеджер;',
    'Менеджер по развитию персонала;',
    'Менеджер по обучению;',
    'Рекрутер;',
    'HR generalist;',
    'HR business partner.'
  ];
  static List<String> hr_page_offer_more_2 = [
    'HR-подразделения крупных компаний;',
    'HR-отделы;',
    'Филиалы;',
    'IT-компании;',
    'Транспортные компании;',
    'Строительные компании;',
    'Финансовый сектор;',
    'и др.'
  ];

  static String hr_page_finder_1 = 'Подбор HR-специалистов';
  static List<String> hr_page_finder_more_1 = [
    'Требуется менеджер по подбору персонала? Специалисты кадрового агентства HR-Library готовы максимально быстро '
        'и качественно решить возникшую кадровую проблему. Свыше 16 лет мы занимаемся отбором резюме настоящих профессионалов '
        'и закрытием вакансий по всем направлениям hr-сферы:',
    'подбор и адаптация сотрудников;',
    'кадровое делопроизводство и администрирование;',
    'обучение персонала и проведение тренингов;',
    'разработка бизнес-процессов компании;',
    'карьерное планирование и развитие персонала;',
    'формирование и поддержание HR-бренда;',
    'поддержка руководителей подразделений по hr-вопросам и др.',
    'По каждой компетенции мы располагаем своими экспертами, имеющими значительный практический '
        'опыт в поиске и подборе кандидатов, способных грамотно оценить как профессиональные качества менеджера по обучению персонала, '
        'так и hr-директора по персоналу.',
    'Мы уверенны что профессиональные специалисты в сфере управления персоналом способны оказать серьезное влияние на показатели компании, '
        'сделать коллектив боле сплочённым и вовлечённым, сократить текучесть персонала и создать оптимальную систему мотивации '
        'и адаптации персонала.'
  ];
  static String hr_page_finder_2 = 'Принципы подбора HR-специалистов';
  static List<String> hr_page_finder_more_2 = [
    'Специалисты кадрового агентства HR-Library тщательно подходят к выполнению своей работы, '
        'не считая свою работу законченной после подбора и трудоустройства кандидата. '
        'На протяжении всего испытательного срока мы сопровождаем его и компанию клиента, определяя, какие требования выполнены, '
        'а какие не удалось осуществить и по каким причинам. Для этого обязательно проводим:',
    'консультационные встречи;',
    'мониторинг решения поставленных задач;',
    'контролируем процесс адаптации специалиста.',
    'Таким образом, мы всегда вовремя реагируем на изменение ситуации и быстро решаем возникающие проблемы. '
        'В конечном итоге, такой подход позволяет нам гарантировать эффективность работы подобранного нами сотрудника и удовлетворение '
        'всех требований работодателя.',
    'Оставляйте заявку, специалисты кадрового агентства HR-Library подберут квалифицированных HR-специалистов, '
        'которые действительно любят и знают свое дело, успешно применяют современные кадровые технологии.'
  ];

  // Engineer Page -------------------------------------------------------------
  static String engineer_text = 'ПОДБОР ИНЖЕНЕРОВ И ТЕХНИЧЕСКИХ СПЕЦИАЛИСТОВ';
  static List<String> engineer_offer_1_more = [
    'Главный инженер;',
    'Инженер ПТО;',
    'Менеджер по качеству;',
    'Менеджер проекта;',
    'Руководитель производства;',
    'Энергетик;',
    'Технический директор;',
    'и др.'
  ];
  static List<String> engineer_offer_2_more = [
    'Торговля;',
    'Строительство;',
    'Производство;',
    'Логистика;',
    'Добыча и переработка ресурсов;',
    'Банки и лизинговые компании;',
    'IT и инновационные организации;',
    'и др.'
  ];

  static String engineer_finder_1 = 'Как найти инженера?';
  static List<String> engineer_finder_1_more = [
    'Вам нужен высококвалифицированный и опытный инженер? Закажите поиск соответствующего специалиста '
        'в нашей компании на самых выгодных условиях:',
    'По доступной и полностью обоснованной цене;',
    'Оперативно;',
    'С официальными гарантиями;',
    'Полноценным информативным сопровождением на всех этапах поиска, отбора и прохождения соискателем исполнительного срока.',
    'Мы обеспечим эффективную экономию, как временного, так и материального ресурса, избавим Вас и Ваших кадровиков '
        'от любых возможных рисков, неудач или ошибок.',
    'Наши опытные рекрутеры применяют лучшие мировые практики и методики отбора профильных специалистов, '
        'поэтому своим клиентам мы предоставляем только наиболее достойных кандидатов.',
    'Собственная расширенная база соискателей и регулярный мониторинг рынка труда позволяет нам своевременно отбирать только '
        'лучших профессионалов, причем в рекордно короткие сроки.',
    'Если Вы уже готовы предложить работу инженером потенциальным кандидатам, заполните заявку на звонок.'
  ];
  static List<String> engineer_finder_2_more = [
    'Абсолютная конфиденциальность',
    'Максимально увеличенные возможности поиска необходимого профи',
    'Если требуется инженер без опыта работы, мы готовы произвести отбор подходящих кандидатов среди выпускников лучших ВУЗов',
    'Бесплатный анализ текущей ситуации требуемого направления на рынке труда, мониторинг окладов, премиальных, '
        'бонусов для соискателей конкретного уровня',
    'Проверка достоверности предоставляемых соискателем данных, в том числе рекомендательных писем с прошлых мест трудоустройства, '
        'проверка кандидатов собственной службой безопасности'
  ];

  // Building Page -------------------------------------------------------------
  static String building_text =
      'ПОДБОР РУКОВОДИТЕЛЕЙ И СПЕЦИАЛИСТОВ В СТРОИТЕЛЬНОЙ СФЕРЕ';
  static List<String> building_offer_1 = [
    'прораб;',
    'инженер ПТО;',
    'кадастровый инженер;',
    'инженер-проектировщик;',
    'инженер-конструктор;',
    'ГИП и ГАП;',
    'директор по строительству;',
    'генеральный директор.'
  ];
  static List<String> building_offer_2 = [
    'строительство объектов;',
    'строительство теплотехнических объектов;',
    'строительство энергетических объектов и систем;',
    'возведение и проектирование инженерных сетей;',
    'проектирование технических объектов;',
    'и др.'
  ];

  static String building_finder_1 = 'Подбор персонала в строительной сфере';
  static List<String> building_finder_more_1 = [
    'Воспользовавшись нашей услугой, вы сможете пополнить свой штат квалифицированным специалистом, '
        'способным эффективно решать поставленные задачи и трудиться на успех всей компании.',
    'В процессе поиска нового сотрудника на открытую вакансию мы:',
    'изучаем доступные базы с резюме для выявления подходящих кандидатов;',
    'проводим тестирование и анкетирование соискателей для определения уровня владения профессиональными навыками;',
    'проверяем наличие у специалистов необходимых допусков и сертификатов;',
    'составляем подробные рекомендации на кандидатов.',
    'Для поиска персонала мы используем, как традиционные методы подбора – публикации объявлений в газетах и опрос знакомых, '
        'так и такой надежный способ, как отбор сотрудников на профильных и закрытых интернет-ресурсах.',
    'Комплексный подход позволяет нам подбирать нужного специалиста в максимально сжатые сроки '
        'и предоставлять гарантию его замены в течение 2-х лет.'
  ];
  static String building_finder_2 = 'Как мы работаем?';
  static List<String> building_finder_more_2 = [
    'Согласование с заказчиком заявки на подбор специалиста.',
    'Подписание официального договора.',
    'Поиск резюме в собственной базе специалистов и закрытых интернет-источников.',
    'Первичный отбор кандидатов в соответствии с требованиями.',
    'Проверка рекомендаций специалиста с предыдущих мест работы.',
    'Собеседование сотрудника отдела HR-Library с соискателями.',
    'Тестирование кандидатов по уникальным методикам.',
    'Предоставление списка отобранных специалистов заказчику.'
  ];

  // Logistics Page ------------------------------------------------------------
  static String logistics_text =
      'ПОДБОР ПЕРСОНАЛА В СФЕРЕ ТРАНСПОРТНОЙ И СКЛАДСКОЙ ЛОГИСТИКИ';
  static List<String> logistics_offer_1_more = [
    'Кладовщик;',
    'Начальник отдела логистики;',
    'Логист;',
    'Руководитель отдела логистики;',
    'Начальник склада;',
    'Топ-персонал;',
    'Директор по логистике;',
    'Начальник транспортного отдела;',
    'Менеджер по продажам логистических услуг.'
  ];
  static List<String> logistics_offer_2_more = [
    'В логистические компании;',
    'В логистические подразделения;',
    'В транспортные компании;',
    'В порты и стивидорные компании;',
    'В терминалы;',
    'В сферу розничной торговли.'
  ];

  static String logistics_finder_1 = 'Подбор персонала';
  static List<String> logistics_finder_1_more = [
    'Благодаря собственной базе, включающей сотни профессионалов, и длительной практике, '
        'мы оперативно закрываем вакансии на любые должности:',
    'рядовых позиций: логистов, диспетчеров или водителей,',
    'руководящих позиций: гендиректоров для транспортных компаний, директоров по логистике, начальников отделов и подразделений.',
    'Обратившись к нам, вы получите замотивированного профессионала в логистике!',
    'За годы работы мы досконально изучили существующие требования на рынке складской и транспортной логистики, '
        'поэтому предоставляем только квалифицированных специалистов с нужными профессиональными знаниями и личностными качествами.'
  ];
  static String logistics_finder_2 = 'Принципы подбора логистов';
  static List<String> logistics_finder_2_more = [
    'Сегодня грамотный и опытный логист – востребованный специалист на рынке труда, '
        'который довольно быстро находит подходящую для него компанию. Поэтому подобрать такого сотрудника чрезвычайно сложно, '
        'не используя набор как современных, так и проверенных временем методов.',
    'Поэтому при поиске квалифицированного логиста мы не только изучаем резюме кандидатов, '
        'но и используем десятки критериев, которые определяем исходя из требований заказчика и круга обязанностей специалиста. Среди них:',
    'личные качества соискателя, такие, как порядочность, ответственность, аккуратность и честность;',
    'его способность оптимизировать существующие и составлять новые эффективные транспортные схемы;',
    'имеющийся у него практический опыт в области логистики;',
    'способность ориентироваться в новых логистических концепциях и бизнес-процессах;',
    'его умение анализировать и прогнозировать ситуацию.'
  ];

  //Employee Page --------------------------------------------------------------
  static String worker_page_text = 'ПОДБОР РАБОЧЕГО ПЕРСОНАЛА';
  static List<String> worker_page_offer_1 = [
    'сварщик;',
    'грузчик;',
    'монтажник;',
    'водитель;',
    'разнорабочий;',
    'механик;',
    'электрик;',
    'упаковщик;',
    'сборщик;',
    'фасовщик;',
    'слесарь и др.'
  ];
  static List<String> worker_page_offer_2 = [
    'строительство и реконструкции;',
    'производство;',
    'монтажные и сварочные работы;',
    'розничная торговля;',
    'складские терминалы;',
    'международные и внутренние грузоперевозки;',
    'и др.'
  ];

  static String worker_page_finder_1 = 'Найм рабочего персонала';
  static List<String> worker_page_finder_more_1 = [
    'Воспользовавшись нашей услугой по подбору рабочего персонала, вы сможете не отвлекаться от решения основных бизнес-задач '
        'и не тратить драгоценное время поиск, отбор и оформление линейного персонала.',
    'Наши профессиональные рекрутеры полностью возьмут процесс подбора рабочих на себя, тщательно выполнят каждый этап рекрутинга:',
    'выяснят Ваши требования к работникам;',
    'проведут поиск кандидатов, используя множественные источники и нашу базу;',
    'грамотно отберут лучших работников;',
    'предоставят вам полностью подходящих сотрудников;',
    'выведут их на работу.',
    'При этом мы собираем важные данные о кандидате: наличие судимости, административных нарушений, образование, адрес регистрации; '
        'отсутствие вредных привычек, семейное положение, состояние здоровья. '
        'Их перечень может меняться в зависимости от специфики открытой в компании вакансии.',
    'При подборе рабочих мы применяем отлаженную годами методику, которая позволяет быстро находить и выбирать идеально подходящих сотрудников, '
        'способных выполнять поставленные задачи.'
  ];
  static List<String> worker_page_finder_more_2 = [
    'Гарантированный отсев «группы риска».',
    'Среди кандидатов на рабочие специальности особую категорию составляют соискатели, '
        'способные доставить различные трудности руководству при совместной работе. '
        'К ним относятся проблемные и постоянно недовольные кандидаты.',
    'Соблюдение конфиденциальности.',
    'Наши рекрутеры никогда не разглашают полученную информацию о кадровых потребностях компании клиента, '
        'вплоть до количества открытых вакансий и размера заработной платы рабочих.',
    'Решение задач любой сложности.',
    'Мы являемся профессионалами своего дела и подбираем рабочий персонал даже таких редких специальностей, '
        'как краснодеревщик, пескоструйщик, промышленный альпинист и постижер.',
    'Тщательный поиск.',
    'Наши рекрутеры занимаются поиском рабочего персонала везде. Мы ищем работников не только в газетах и интернете. '
        'Мы участвуем в ярмарках вакансий, в профильных выставках и конечно, ищем по рекомендациям.'
  ];

  // FinancierPage -------------------------------------------------------------
  static String financier_text = 'ПОДБОР ПЕРСОНАЛА В СФЕРЕ ФИНАНСОВ';
  static String financier_offer_1 = 'Специализируемся на подборе:';
  static List<String> financier_offer_1_more = [
    'бухгалтер;',
    'главный бухгалтер;',
    'финансовый директор;',
    'аудитор;',
    'экономист;',
    'финансовый менеджер;',
    'главный бухгалтер;',
    'бухгалтер по участкам;',
    'бухгалтер на первичную документацию;',
    'и др.'
  ];
  static List<String> financier_offer_2_more = [
    'Производство',
    'Строительство',
    'Оптовая торговля',
    'Розничная торговля',
    'Услуги',
    'Логистика и транспорт',
    'Банки и страховые компании',
    'Образование и научные исследования',
    'Общепит',
    'Управляющие компании'
  ];

  static String financier_finder_1 = 'Найдем нужного специалиста';
  static List<String> financier_finder_1_more = [
    'Как показывает практика, самостоятельный поиск не всегда дает желаемый результат, и, как правило, '
        'отнимает достаточно большое количество времени.',
    'Поэтому мы создали специальный отдел, HR-менеджеры которого быстро и качественно находят персонал, как для крупных страховых, '
        'финансовых и инвестиционных компаний, так и для небольших организаций.',
    'Сегодня в нашей базе содержатся множество резюме , обладающих необходимым опытом и квалификацией',
    'Если же вам нужен главный бухгалетр, начальник ПЭО, финансовый директор, аудитор - оставляйте заявку в кадровое агентство HR-Library. '
        'Мы всегда готовы предоставить достойный выбор профессиональных кандидатов.'
  ];
  static List<String> financier_finder_2_more = [
    'Перед собеседованием мы тщательно изучаем резюме кандидатов. Посредством нескольких этапов выбираем наиболее подходящих.',
    'Всегда отбираем из нескольких финальных кандидатов, учитывая и их психологическую совместимость с руководителем, '
        'умение доводить работу до конца, перепроверять себя, брать на себя ответственность, и быть лояльным сотрудником к '
        'компании-работодателю.',
    'Такой подход позволяет нам гарантировать 100% положительный результат и оперативное закрытие вакансии.',
    'Кадровое агентство HR-Library – экономия времени и гарантия закрытия вакансии в минимальные сроки.',
    'Оставляйте заявку, сотрудники нашего специализированного отдела по поиску персонала в финансовой сфере будут рады помочь в любое время!'
  ];

  //Strings IT employee page --------------------------------------------------
  static String it_employee_text = 'ПОДБОР ПЕРСОНАЛА В IT-СФЕРЕ';
  static String it_employee_offer_work = 'Мы подбираем следующих специалистов:';
  static List<String> it_employee_offer_more_1 = [
    'программист Java;',
    'программист Python;',
    'программист Scala;',
    'программист JavaScript;',
    'программисты C++ и C#;',
    'специалист по защите информации;',
    'системный администратор;',
    'тестировщик ПО;',
    'SMM специалист;'
  ];
  static List<String> it_employee_offer_more_2 = [
    '1С программисты;',
    'начальник отдела ИТ;',
    'SEO-оптимизатор;',
    'директолог;',
    'администратор баз данных;',
    'HTML-верстальщик;',
    'веб-дизайнер;',
    'менеджер интернет-проектов;',
    'контент-менеджер.'
  ];

  static String it_employee_finder = 'Подбор IT-персонала';
  static List<String> it_employee_finder_more = [
    'Отбираем только квалифицированных ИТ-специалистов, способных работать на результат и эффективно решать поставленные перед ними задачи. '
        'В процессе многоступенчатого отбора используем как классические, так и передовые методы подбора персонала:',
    'интервьюирование кандидатов с видео-фиксацией;',
    'тестирование претендентов для оценки уровня их профессионализма;',
    'проверку рекомендаций коллег, руководителей или партнеров соискателя.',
    'Мы даем двухлетнюю гарантию на закрытую вакансию и бесплатно предоставляем замену отобранному кандидату, '
        'если он не пройдет испытательный срок или уволится по собственному желанию.',
    'Вы оплачиваете приход в вашу компанию только тех специалистов, которые готовы работать с вами долго. '
        'И не тратите время и средства на средства на бесполезных и немотивированных сотрудников.'
  ];

  static List<String> it_employee_what_more = [
    'HR-LIBRARY постоянно отслеживают состояние рынка труда в области IT-сектора',
    'Активно участвуют в различных конференциях и мероприятиях, посвященным информационным технологиям',
    'Совершенствуют свои навыки подбора IT-специалистов',
    'Желаете найти высококлассного ИТ-специалиста в свою команду?',
    'Позвоните и оставьте заявку на подбор нужного кандидата.'
  ];

  //Strings mass recruitment page ----------------------------------------------
  static String mass_recruitment = 'МАССОВЫЙ ПОДБОР ПЕРСОНАЛА';
  static String with_us = 'С нами вы сможете';
  static List<String> with_us_more = [
    'Быстро и легко закрывать однотипные вакансии',
    'Планировать бюджет на длительный период',
    'Наслаждаться оптимальной ценой на массовый подбор персонала'
  ];
  static String how_mach = 'Узнайте стоимость';
  static String why_hr_lib = 'Почему HR LIBRARY?';
  static List<String> why_hr_lib_more = [
    'Наши технологии массового подбора персонала проверены на сотнях проектов',
    'Всегда большое число подходящих кандидатур',
    'Гибкое управление процессом поиска сотрудников',
    'Беспрерывный и объемный поток соискателей – снимается проблема «текучки»',
    'Оперативная коррекция вакансий в зависимости от потребностей',
    'Экономия времени благодаря передаче задания профессионалам'
  ];
  static String mass_recruitment_text = 'МАССОВЫЙ ПОДБОР ЛИНЕЙНОГО ПЕРСОНАЛА –';
  static String mass_recruitment_text_more =
      'это отбор сотрудников среднего звена и рабочих специальностей с формальными требованиями'
      ' к соискателям. Это крупный проект, имеющий несколько этапов: предварительная подготовка, '
      'первичный отбор и сопровождение штатного персонала.'
      'Подобные мероприятия требуют больших временных и кадровых затрат. '
      'Рекрутинговое агентство HR LIBRARY знает все о том, что такое массовый подбор персонала. '
      'Мы найдем и отберем сотрудников по формальным требованиям с целью закрытия большого числа однотипных линейных вакансий '
      'в короткое время.';

  static String mass_rec_price_validate =
      'Цена массового подбора персонала зависит от:';
  static List<String> mass_rec_price_validate_more = [
    'Продолжительности кампании',
    'Количества вакансий',
    'Количества требований к соискателям'
  ];

  //Strings Executive Search ----------------------------------------------------

  static String executive_search =
      'EXECUTIVE SEARCH - ТОЧЕЧНЫЙ ПОДБОР ИДЕАЛЬНЫХ СПЕЦИАЛИСТОВ';
  static String why_this_method = 'Преимущества метода:';
  static List<String> why_executive_search_more = [
    'Конфиденциальность: неразглашение факта переговоров — одно из важных условий;',
    'Индивидуальный подход: мы умеем «подстраиваться» под особенности клиента;',
    'Аргументация: если специалист и не ищет работу, мы сумеем выстроить диалог;',
    'Специализация: у нас есть эксперты в отрасли, в которой ведётся подбор;',
    'Личные коммуникации: мы имеем полезные контакты для поиска и рекомендаций;',
    'Внимание к мелочам: учитываем любые ваши запросы и требования.'
  ];

  static String executive_search_complex = 'Комплексный Executive Search';
  static List<String> executive_search_complex_more = [
    'В первую очередь мы определяем требования к навыкам и опыту, которыми должен обладать кандидат.',
    'Обязательно формируем список тех, кто удовлетворяет всем критериям заказчика, '
        'обращая внимание на результативность специалистов и их показатели при работе в других компаниях.',
    'Проводим собеседования с использованием комплексных методик, позволяющих определить уровень квалификации, '
        'достижений, профессиональные навыки, опыт работы и психологический портрет соискателей.',
    'Мотивируем кандидатов, интересующих заказчика, на переход в его компанию.',
    'Такой комплексный подбор занимает от двух недель до полутора месяцев и зависит от сложности закрываемой вакансии,'
        ' а также предъявляемых требований к сотруднику.'
  ];

  static String executive_search_what = 'EXECUTIVE SEARCH –';
  static String executive_search_what_more =
      'уникальная услуга, предоставляемая рекрутерами агентства HR Library. '
      'В нашем распоряжении имеется обширная база резюме опытных менеджеров высшего звена, '
      'позволяющая оперативно подбирать топ-персонал в любой профессиональной сфере. Задействуя квалифицированную команду экспертов, '
      'состоящую из аналитика, консультанта Executive Search и ассистента, мы гарантируем заказчикам точность подбора персонала и результат, '
      'удовлетворяющий всем требованиям.'
      'Если подходящий топ-менеджер отсутствует в нашей базе, мы формируем список компаний, в которых могут работать интересующие '
      'заказчика специалисты. Дополнительно составляются отчет о ситуации, сложившейся на рынке труда в данной отрасли, зарплатный срез '
      'по вакансии и список потенциальных кандидатов, способных получить в перечисленных компаниях нужные знания, связи и опыт.';

  static String executive_search_price = 'EXECUTIVE SEARCH C HR LIBRARY ЭТО:';
  static List<String> executive_search_price_more = [
    '2-х летняя гарантия того, что найденный топ соответствует всем вашим пожеланиям и подходит для данной работы',
    'Бесплатная замена выбранного кандидата, если по какой-то причине он не подойдёт',
    'Стоимость Executive Search от 18% до 24% от ожидаемого годового дохода руководителя'
  ];

  //Strings RECRUITMENT -------------------------------------------------------

  static String recruitment_text = 'ПОДБОР ПЕРСОНАЛА';

  static String recruitment_what_offer =
      'Что включает услуга подбора персонала';
  static List<String> recruitment_what_offer_more = [
    'Анализ рынка труда по вашей вакансии',
    'Профессионального рекрутера со знанием вашей отрасли',
    'Доступ к закрытым базам и источникам резюме',
    'Охват всего рынка соискателей',
    'Оценку максимального количества резюме',
    'Бланк проверки достоверных рекомендаций претендента',
    'Экономию личного времени',
    'Строгое соблюдене сроков подбора'
  ];

  static String recruitment_problem = 'Актуальные проблемы подбора персонала';
  static List<String> recruitment_problem_more = [
    'Кадровый парадокс периода пандемии и удалённой работы — это трудности с поиском специалистов при немалом количестве соискателей.',
    'Качественный рекрутинг — это не формальное закрытие вакансии, а подбор нужного специалиста. '
        'HR-тренд современности: лучше один профессионал, чем полный отдел незнаек.',
    'Оптимизация расходов на персонал — это не отказ от услуг HR-агентства, а вложение денег с максимальной пользой. '
        'Попытка сэкономить на услугах рекрутингового агентства приводит к потерям в перспективе. '
        'Расходы на поиск, на адаптацию, обучение, на увольнение, текучка некомпетентных кадров — это те непродуктивные потери, '
        'которых нужно и можно избежать.'
  ];

  static String recruitment_how_work = 'Как мы подбираем персонал?';
  static List<String> recruitment_how_work_more = [
    'Для подбора квалифицированного персонала нам необходимо:',
    'Составить профиль должности данной позиции и создать профессиональную презентацию вакансии;',
    'Задействовать все источники поиска, что означает размещение вакансии на всех доступных ресурсах,'
        ' а также обзвон претендентов по открытым и закрытым базам резюме. Кроме того, мы используем собственные базы соискателей, '
        'и другие возможные каналы поиска;',
    'Осуществить грамотный первичный отбор на основе телефонных интервью и онлайн-тестирования;',
    'Оценить и проверить кандидатов, прошедших предыдущий этап отбора и приглашённых на личную встречу. '
        'Наши рекрутёры и эксперты проводят с ними интервью в офисе HR-Library;',
    'Собрать рекомендации с предыдущих мест трудоустройства кандидатов, проверить их по всем критериям безопасности;',
    'Выбрать и представить клиенту лучших кандидатов, обосновав наш выбор развёрнутыми комментариями;',
    'Помочь сделать окончательный выбор.'
  ];

  static List<String> recruitment_what_more = [
    'Конфиденциальность при работе над проектами - это важно!',
    'Ищем везде, а не на двух сайтах! Задействуем базу, сеть рекомендаций, сеть коллег в других рекрутинговых агентствах, '
        'прямой поиск, форумы, выставки, профессиональные сообщества, социальные сети и более 10 профильных сайтов.',
    'Проводим бесплатный мониторинг рынка труда.',
    'Настойчиво узнаем рекомендации на каждого кандидата у его непосредственного руководителя',
    'Любим решать тяжелые HR задачи!'
  ];

  //Strings STAFF OUTSOURCING -------------------------------------------------

  static String staff_out_text = 'АУТСОРСИНГ ПЕРСОНАЛА';
  static List<String> staff_out_more = [
    'Сосредоточитесь на выполнении главных целей бизнеса, не занимаясь вопросами привлечения кадров, обустройством рабочих мест и др.',
    'Сократите финансовые затраты компании в целом.',
    'Увеличите эффективность работы предприятия за счет квалифицированных специалистов, способных решать сложные задачи.',
    'Освободите бухгалтерский штат от необходимости оформления работников и начисления заработной платы.',
    'Развивайте новые бизнес-направления, благодаря освобождению человеческих и финансовых ресурсов.'
  ];

  static String staff_out_why = 'Аутсорсинг';
  static List<String> staff_out_why_more = [
    'Требуются настоящие профессионалы для временной, но очень ответственной работы? '
        'Воспользуйтесь нашей услугой аутсорсинга рабочего персонала, позволяющей решить проблему поиска специалистов с наименьшими рисками. '
        'Мы предоставим нужных сотрудников для постоянной, временной или вахтовой работы, '
        'которые будут полностью удовлетворять вашим требованиям как с профессиональной, так и с психологической точки зрения.',
    'Особенно выгоден аутосоринг персонала в ситуациях, когда требуется быстро нанять большое количество специалистов. '
        'В этом случае все обязанности по набору сотрудников, обучению, проверке их опыта и надежности ложатся на наших менеджеров, '
        'давая вам возможность спокойно заниматься своими делами и не тратить лишнее время.'
  ];

  static String staff_out_is = 'АРЕНДА ИЛИ КАДРОВЫЙ АУТСОРСИНГ ПЕРСОНАЛА –';
  static String staff_out_is_more =
      'один из прогрессивных инструментов управления кадровыми ресурсами.'
      'Широко используется многими успешными и процветающими компаниями. '
      'Он позволяет привлекать нужных специалистов лишь на определенное время, например, для проведения рекламной кампании '
      'или сдачи налогового отчета.';

  static String staff_out_what = 'А что еще?';
  static List<String> staff_out_what_more = [
    'Обширная база данных.',
    'Оперативная замена персонала.',
    'Оформление всей разрешительной документации для работы сотрудников.',
    'Оплата услуги на основании акта выполненных работ.',
    'Используя наши ресурсы, вы сможете быстро расширить ваш бизнес без особых затрат. '
        'Наше кадровое агентство предоставляет только высококвалифицированный персонал, '
        'подбирая оптимальные варианты сотрудничества и сжатые сроки выполнения заявки.',
    'Позвоните, чтобы узнать стоимость аутосоринга персонала в нашей компании. '
        'Специалисты HR-LIBRARY оперативно подготовят индивидуальный прайс-лист, максимально учитывающий потребности компании '
        'и ваши личные запросы.'
  ];

  //Strings HEAD HUNTING ----------------------------------------------------------------------

  static String head_hunting_text = 'ХЕДХАНТИНГ';
  static List<String> head_hunting_why_more = [
    'Методы хедхантинга в нашем агентстве не бросят тень на заказчика, так как конфиденциальность лежит в основе нашего сотрудничества.',
    'Headhunting помогает компании взять успешный опыт конкурента и внедрить его у себя, но если переманивать напрямую, '
        'минуя агентство можно получить разного рода проблемы.',
    'Технологии хедхантинга позволяют досконально изучить кандидатов, составить их профессиональную и психологическую характеристику, '
        'узнать, что их может мотивировать, заинтересовать, ради чего они готовы будут сменить работу.',
    'После определения одного-двух потенциальных специалистов проводятся собеседования с каждым из них. '
        'Переманивание сотрудников из других организаций – дело хлопотное и длительное, но в результате вы получаете '
        'именно такого профессионала, о котором мечтали, и который соответствует всем вашим критериям.'
  ];

  static String head_hunting_why_need = 'Зачем нужно переманивать сотрудников?';
  static List<String> head_hunting_why_need_more = [
    'Чаще всего такими услугами пользуются для подбора специалистов высокого уровня, '
        'а также тех, у кого достаточно узкий профиль и редкая профессия. Обычно такие люди не интересуются вакансиями на job-сайтах. '
        'Хедхантинг использует множество уловок и хитростей для того, чтобы вы получили нужного вам человека.',
    'Что такое headhunting? Он позволяет привлечь на работу профессионалов с необходимыми знаниями и опытом, '
        'которые могут принести существенную пользу вашему предприятию, но не ищут работу в данный момент.'
  ];

  static String head_hunting_is = 'ХЕДХАНТИНГ –';
  static String head_hunting_is_more =
      'это инструмент, который позволит вам найти ценный кадр, если невозможно привлечь его стандартными '
      'методами. Он поможет тогда, когда вы точно знаете, кто вам нужен. '
      'Headhunting – это переманивание конкретного успешного специалиста у конкурентов. Если вы не знаете, кого хотите переманить, '
      'и вам интересны кандидаты из целого спектра компаний, - то это Executive search. '
      'Мы с одинаковым успехом выполним любую из этих услуг для вас. '
      'Наша рекрутинговая компания предлагает хантинг персонала, который даже не задумывается о смене работы. Мы переманим его к вам.';

  static String head_hunting_guarantee = 'ТРОЙНАЯ ГАРАНТИЯ:';
  static List<String> head_hunting_guarantee_more = [
    'Гарантия эффективности сотрудника - Возвращаем деньги, если подобранный нами сотрудник работает неэффективно.',
    'Гарантия скорости подбора - Подходящий вам специалист станет сотрудником вашей компании в самые короткие сроки.',
    'Гарантия замены сотрудника - В случае ухода сотрудника во время испытательного срока мы оперативно подберем '
        'для вас нового специалиста бесплатно.'
  ];

  //Strings home page ----------------------------------------------------------

  static String offer_our_title = 'УСЛУГИ';
  static String employee_agency_title = ' КАДРОВОГО АГЕНТСТВА';

  static String opinion_personal = 'Опыт подбора\n   персонала';
  static String success_work = 'Успешные кейсы';
  static String personal_save = 'Гарантия на персонал';
  static String button_for_company_home = 'Подбор Персонала';
  static String button_for_hr_home = 'Соискателям';

  static String set_offer = 'ОСТАВИТЬ ЗАЯВКУ';
  static String set_offer_free_consultation = 'на бесплатную консультацию';
  static String offer_home_page_text = 'Развиваемся вместе с вами!';
  static String offer_home_page_more_text =
      'Кадровое агентство по подбору персонала «Эйч Ар Лайбрэри» ведет поиск не только в Киеве '
      'и по всей Украине, но и в странах СНГ и Европы.'
      'Наше агентство специализируется на поиске и подборе квалифицированных кадров, руководителей подразделений '
      'и топ-менеджеров для всех отраслей бизнеса. Помимо классических рекрутинговых инструментов, используем сложные хантинговые технологии '
      'и executive search.'
      'В нашей команде работают исключительно эксперты в сфере рекрутинга.'
      'Наличие подразделений с отраслевыми специализациями позволяет оперативно находить и '
      'оценивать персонал по разным профессиональным направлениям. Работать с вашей заявкой будет рекрутер, '
      'который знает специфику вашего бизнеса и имеет наработанную практику в необходимой специализации. '
      'Обращаясь в рекрутинговое агентство «Эйч Ар Лайбрэри», вы получаете опыт и знания лучших экспертов отрасли! '
      'Рекрутинговое агентство «Эйч Ар Лайбрэри» — это команда профессионалов, давно зарекомендовавших '
      'себя в сфере кадровых решений. Мы умеем искать и находить, нам доверяют, к нам возвращаются, нас рекомендуют!';

  static String why_we_best = 'В чем преимущества агентства HR-Library?';

  static String why_we_title_1 = 'Специализация направлений рекрутинга';
  static String why_we_about_1 =
      'Мы создали профильные отделы, где с вашим заказом работают эксперты '
      'по различным отраслям и сферам бизнеса: IT, Финансы, Бухгалтерия, Маркетинг, Продажи, Логистика, Промышленность и т.д. '
      'В каждом из отраслевых направлений над закрытием вакансий работают исключительно профессионалы с релевантным опытом, '
      'то есть, имеющие рабочую практику именно в данной отрасли, хорошо знакомые с особенностями подбора персонала.';

  static String why_we_title_2 = 'Максимальный охват рынка труда';
  static String why_we_about_2 =
      'В работе над вашим заказом мы задействуем более 50 источников поиска потенциальных работников. '
      'Для поиска и подбора, помимо собственной базы агентства, мы используем платные ресурсы, социальные сети, бизнес-порталы, '
      'профессиональные форумы, отраслевые конференции, и другие источники. Мы умеем находить там, где другие агентства даже не ищут!';

  static String why_we_title_3 = 'Работаем без предоплаты!';
  static String why_we_about_3 =
      'Даже если вакансия будет закрыта Вами самостоятельно, мы не требуем выплаты неустойки. '
      'Наша обязанность — подбор кадров для вашего бизнеса, а не просто продажа услуг. '
      'Если вы нашли персонал самостоятельно — отлично!';

  static String why_we_title_4 = 'Эксклюзивная база работников';
  static String why_we_about_4 =
      'Наше рекрутинговое агентство обладает актуальной и структурированной базой специалистов '
      'по конкретным должностям и направлениям. База постоянно обновляется данными о сотрудниках компаний различных отраслей, '
      'в том числе и специалистах востребованных направлений. Это позволяет нам обрабатывать заказы быстро и с '
      'максимально высоким результатом, находить и предоставлять первых кандидатов уже через сутки. '
      'Благодаря этому наше агентство закрывает вакансии оперативнее остальных, а компетенции подобранного нами персонала '
      'максимально отвечают заявке работодателя.';

  static String why_we_title_5 = 'Контроль надежности и безопасности';
  static String why_we_about_5 =
      'В отличие от других кадровых агентств, при закрытии вакансии мы уделяем особое внимание '
      'этапу сбора рекомендаций от руководителей с прежних мест трудоустройства. Наше умение искать и находить нужную информацию — основа '
      'безопасности для вашего бизнеса и залог успешного результата в процессе подбора персонала. '
      'Мы не допустим, чтобы к вам попал сотрудник с туманным прошлым!';

  static String why_we_title_6 = 'Выгодные гарантийные условия';
  static String why_we_about_6 =
      'При увольнении сотрудника наше агентство оперативно и бесплатно подберёт для вас нового специалиста. '
      'Гарантия сроком до 2 лет обязательно прописывается в Договоре.';

  static String free_monitoring_learn_head =
      'Закажите бесплатный мониторинг рынка труда!';
  static String free_monitoring_learn_more = 'Узнайте:';
  static List<String> free_monitoring_learn_more_list = [
    'Какова стоимость специалиста на рынке труда?',
    'Какая система мотивации для нужной позиции в других организациях?',
    'Какие условия работы предлагают руководители компаний-конкурентов?',
    'Каков объем спроса и предложений на требуемую вакансию?'
  ];

  // Strings for_employee page ----------------------------------------

  static String set_cv = 'ДОБАВИТЬ РЕЗЮМЕ';
  static String set_cv_to_database = 'в нашу базу данных';
  static String no_file_selected = 'Файл не выбран';
  static String select_file = 'Выбрать файл резюме';
  static String find_work = 'ПОИСК РАБОТЫ:';
  static String send_cv_to_hr_library = 'Отправьте резюме в HR-Library';

  static List<String> about_cv = [
    'Наше рекрутинговое агентство не гарантирует вам трудоустройства, но мы добавим ваше резюме в свою базу.',
    'Если ваши компетенции потребуются на одном из проектов, то мы свяжемся с вами.',
    'Обязательно укажите в резюме диапазон ваших ожиданий по заработной плате.',
    'Услуги для соискателей бесплатны',
  ];

  static String how_do_cv = 'Как должно быть составлено резюме?';
  static String local_cv = 'Лаконично';
  static String local_cv_more =
      'Не пишите слишком много, досконально излагая свою биографию. '
      'Величина резюме не должна превышать одной-двух страниц печатного текста, '
      'иначе его просто не будут читать. Если вы сменили множество мест работы – оставьте только самое важное – то, '
      'что принесло уникальный опыт, знания и навыки.';
  static String presentable_cv = 'Презентабельно';
  static String presentable_cv_more =
      'В заголовке резюме нужно указать полное имя, фамилию и отчество, а также должность, '
      'на которую вы претендуете, и уровень заработной платы.';
  static String health_full_cv = 'Полезно';
  static String health_full_cv_more =
      'Не стоит писать много о своих увлечениях, работодателя интересуют ваши профессиональные качества: '
      'образование, опыт работы на других предприятиях, реальные достижения на предыдущих местах работы, '
      'знание языков и уровень пользования компьютером.';
  static String comfortable_cv = 'Удобно';
  static String comfortable_cv_more =
      'Нужно указать контактные данные: личный телефон, e-mail или скайп, '
      'указать удобное время для звонка, чтобы сотрудник отдела персонала смог точно с вами связаться. '
      'Проследите, чтобы ваш email совпадал с фамилией, а не был похож на кличку или псевдоним.';

  // special strings -----------------------------------------------------------
  static String more = 'Подробнее';
  static String learn_more = 'Узнать больше';
  static String contact_us_offer = 'Нужны эффективные сотрудники? Звоните:';

  static String why_we = 'Почему мы?';
  static List<String> why_we_offer = [
    'Начало',
    'О компании',
    'Политика',
    'Контакты'
  ];

  static String who_give_work = 'Работодателю';
  static List<String> who_give_work_list = [
    'Подбор персонала',
    'Executive search',
    'Head Hunting',
    'Аутсорсинг'
  ];

  static String who_worker = 'Соискателю';
  static List<String> who_worker_list = [
    'Советы кандидату',
    'Правила прохождения интервью',
    'Подготовка к собеседованию',
    'Как написать резюме'
  ];

  static String our_offer =
      'Специализируемся на подборе сотрудников в таких направлениях:';
  static List<String> offers_way = [
    'IT, web, digital, связь, телеком',
    'Продажи — руководители и менеджеры',
    'Маркетинг, интернет-маркетинг, реклама, PR',
    'Менеджмент (руководители) высшего звена',
    'Административная работа, секретариат, АХО',
    'Бухгалтерия, финансы, налоги, аудит',
    'HR, кадры, управление персоналом',
    'ИТР в промышленности и на производстве',
    'Руководители и ИТР в проектировании',
    'Транспортный отдел, логистика, ВЭД',
    'Рабочий персонал'
  ];

  static List<String> text_for_button_image = [
    'ПОИСК И ПОДБОР КВАЛИЦИФИРОВАНЫХ \n'
        '                    СПЕЦИАЛИСТОВ',
    'МАССОВЫЙ ПОДБОР ЛИНЕЙНОГО ПЕРСОНАЛА',
    'EXECUTIVE SEARCH',
    'ХЭДХАНТИНГ',
    'АУТСОРСИНГ ПЕРСОНАЛА'
  ];

  static List<String> text_about_offer = [
    'Кадровый консалтинг (HR-консалтинг)',
    'Услуги аутстаффинга персонала',
    'Региональный подбор персонала',
    'Поиск сотрудников по резюме',
    'Кадровый аутсорсинг',
    'Ресечинг (Экспресс поиск)',
    'Скрининг резюме'
  ];

  static List<String> text_more_about_offer = [
    'Консультирование в эффективному управлению персоналом',
    'Вывод персонала за штат компании.',
    'Подбор персонала в регионах Украины и других странах.',
    'Подбор подходящих резюме сотрудников.',
    'Предоставление услуг по ведению кадрового делопроизводства',
    'Организация массового потока соискателей без личной встречи.',
    'Поиск резюме по указанными Вами параметрам по разным базам.'
  ];

  // contact
  static const String number = 'Номер телефона';
  static const String enter_number = 'Введите номер телефона';
  static const String invalid_number = 'Введите корректный номер';

  // privacy politic
  static const String privacy_sting = 'Политика';
  static const String politic_sting = 'Конфиденциальности';
  static const String privacy = '1. Наше обещание конфиденциальности \n '
      'Ваше доверие является ключом к успеху нашего бизнеса. Мы очень серьезно относимся к приватности и конфиденциальности '
      'и защищаем Персональные данные наших пользователей в соответствии с Политикой Конфиденциальности. \n'
      'Термин «Персональные данные» означает всю личную информацию об идентифицируемом индивидуальном вводе пользователей, '
      'включая личную информацию об образовании, навыках, талантах, карьере и опыте работы, а также другую подобную информацию '
      '(но исключая деловую контактную информацию). \n'
      '2. Согласие\n'
      'Используя наши Онлайн-сервисы и предоставляя нам Персональные данные, вы соглашаетесь на их сбор,'
      'использование и раскрытие ваших личных данных (включая в некоторых случаях личную финансовую информацию для целей учетной записи)'
      'нами с целью предоставления вам услуг через сайт HRLibrary.com.ua,'
      ' и управление вашей учетной записью в соответствии с: (a) Политикой Конфиденциальности, '
      '(b) любое другое соглашение, которое вы могли заключить с нами, и (c) применимые законы и правила.'
      ' Вы несете ответственность за то, чтобы мы были информированы о правильной и актуальной контактной информации для вас. \n'
      '3. Размещение информации\n'
      'Размещая любые Персональные данные в тех частях нашего сайта, которые доступны другим пользователям,'
      ' включая любой контент, который может содержать персональные данные, вы даете согласие на отображение этого '
      'Персональные данные и использование этими пользователями этих Персональных данных. '
      'Другие пользователи (например, потенциальные работодатели или рекрутеры)'
      ', которые используют Онлайн-сервисы, будут иметь доступ к Персональным данным, размещенным соискателями. \n'
      '4. Связь\n'
      'Вы разрешаете нам общаться с вами по поводу наших услуг и вашей учетной записи.'
      'Если вы ищете работу, вы соглашаетесь на то, что потенциальные работодатели свяжутся с вами по поводу возможностей трудоустройства.'
      'Вы разрешаете нам общаться с вами через Интернет и по указанному вами адресу электронной почты.'
      'Вы понимаете и принимаете риск того, что Персональные данные и информация, передаваемые через Интернет, '
      'могут быть подвержены ошибкам или нарушениям безопасности. \n'
      '5. Обмен информацией\n'
      'Мы не передаем, не обмениваем, не продаем и никаким образом не раскрываем ваши '
      'Персональные данные без вашего согласия, за исключением случаев, когда такое раскрытие:'
      ' (a) разрешено в соответствии с Политикой Конфиденциальности; (b) требуется по закону; '
      '(c) в соответствии с ордером на обыск или постановлением суда;'
      'или (d) оправдано в ходе расследования совершения преступления, нарушения договора или нарушения закона или постановления. \n'
      '6. Разрешение споров\n'
      'Если у вас есть вопрос, жалоба или спор относительно вашей личной информации'
      'или наши методы обработки личной информации, свяжитесь с нами через Раздел «Contact us» нашего сайта. \n'
      '7. Изменения\n'
      'Мы можем время от времени вносить изменения в настоящую Политику, и измененная форма '
      'Политика вступит в силу через 30 дней после публикации на этой странице.';

}
