class StringsUa {
  StringsUa._();

//Strings new strings ----------------------------------------------------------

  static String employee_agency = 'КАДРОВЕ АГЕНТСТВО';
  static String send_message_form = 'Відправити';
  static String send_message_form_call = 'Замовити дзвінок';
  static String recruiting_for_best = 'Рекрутингова компанія для найкращих';
  static String success_message_start = 'ДЯКУЄМО ЗА ВАШУ ЗАЯВКУ';
  static String success_message_end =
      'наш спеціаліст зв\'яжеться з вами найближчим часом!';

//Strings Article ------------------------------------------------------------
  static String article_text = 'СТАТТІ ДЛЯ СПІВРОБІТНИКІВ';

  static String success_interview_text =
      'УСПІШНЕ СПІВБЕСІДУВАННЯ АБО ЯК ВІДПОВІДАТИ НА ХИТРІ ПИТАННЯ';

  static String preparing_for_interview_text =
      'ГОТУЄМОСЯ ДО СПІВБЕСІДИ. ДЕСЯТЬ ТИПОВИХ ПИТАНЬ РЕКРУТЕРІВ';

  static String cv_starter_interview_text =
      'ЯК НЕ ЗІПСУВАТИ РЕЗЮМЕ? ШІСТЬ ПОМИЛОК СПІВРОБІТНИКА';


//call us Page --------------------------------------------------------------------
  static String call = 'Зателефонувати';
  static String contact_page_text = 'ЗВ\'ЯЗАТИСЯ З НАМИ';
  static String contact_page_finder_1 = 'З нами ви зможете:';


  static const String empty_text = 'Будь ласка, введіть текст';
  static const String name = 'Ім\'я';
  static const String enter_name = 'Введіть ім\'я';
  static List<String> contact_page_finder_1_more = [
    'визначити потенціал співробітників;',
    'визначити рівень компетенції діючих співробітників;',
    'оцінити досягнення фахівців та розмір їх винагород;',
    'підвищити якість управління персоналом;',
    'створити кадровий резерв для керівних посад;',
    'розвинути корпоративну культуру.'
  ];

//Strings Double Text Button -------------------------------------------------
  static String hr_consulting_page_text = 'КАДРОВИЙ HR-КОНСАЛТИНГ';
  static String hr_consulting_page_offer = 'Ми допоможемо вам:';
  static List<String> hr_consulting_page_offer_more = [
    'Розкрити потенціал компанії',
    'Звільнити особистий час для стратегічних завдань',
    'Побудувати управління колективом більш ефективно',
    'Інвестувати в основний ресурс компанії - персонал'
  ];

  static String hr_consulting_page_finder_1 = 'Навіщо потрібен HR-консалтинг?';
  static List<String> hr_consulting_page_finder_1_more = [
    'Одним з ключових напрямків діяльності компанії HR-Library є консультування в галузі управління людськими ресурсами.',
    'Кадровий консалтинг допомагає побудувати ефективну систему керівництва колективом для збільшення ефективності його роботи. '
        'HR консалтинг орієнтований, передусім, на допомогу компаніям у досягненні їх цілей і реалізації ідей, '
        'які вимагають підвищення ефективності роботи з персоналом.',
    'У нашій компанії накопичено не лише досвід в цій галузі, але й база спеціалізованих знань. '
        'Наші консультанти - діючі HR-спеціалісти з немалим досвідом вирішення складних управлінських завдань.'
  ];

  static String hr_consulting_page_finder_2 =
      'КАДРОВИЙ КОНСАЛТИНГ І АУДИТ ДОЗВОЛЯЮТЬ ВАМ:';
  static List<String> hr_consulting_page_finder_more_2 = [
  'Збільшити прибутковість від персоналу та його віддачу',
  'Знизити ротацію персоналу в компанії',
  'Посилити корпоративну прив\'язаність',
  'Покращити показники ефективності',
  'Скоротити персонал без втрат продуктивності',
  'Створити плани розвитку корпоративної культури та управління',
  'Розв\'язати будь-які конфлікти в колективі, які знижують ефективність',
  'Зберегти ключових співробітників, які важливі для бізнесу'
  ];


// OutStaffing Page ----------------------------------------------------------
  static String out_staffing_text = 'АУТСТАФІНГ ПЕРСОНАЛУ';
  static String out_staffing_offer = 'Етапи виведення співробітників за штатом:';
  static List<String> out_staffing_offer_more = [
    'Подання заявки',
    'Аналіз',
    'Договір',
    'Трудоустрій',
    'Розрахунок',
    'Працюємо!'
  ];

  static String out_staffing_finder_1 = 'Що таке аутстаффінг?';
  static List<String> out_staffing_finder_1_more = [
  'Аутстаффінг («вивід за штатом») - тимчасовий перехід персоналу зі штату однієї компанії в іншу.',
  'Співробітники працюють при цьому на своїх посадах, зберігаючи ті самі функції та обов\'язки, що і раніше. '
  'Але їхнім роботодавцем виступає вже компанія-аутстаффер. Юридична та фактична відповідальність '
  'за кожну особу, яка була виведена за штат, покладається тепер на неї.'
  ];

  static String out_staffing_finder_2 =
      'Чим відрізняється аутсорсинг від аутстаффінгу?';
  static List<String> out_staffing_finder_2_more = [
  'У обох випадках йдеться про залучення до роботи сторонніх співробітників. '
  'І хоча схожість цих понять обмежується цим, багато хто їх нерідко плутає.',
  'При аутсорсингу персоналу зовнішній персонал виконує для замовника який-небудь певний процес або етап робіт, '
  'що входять великий проект.',
  'При аутстаффінгу замовник отримує персонал у своє розпорядження на визначений час і сам організовує його роботу.',
  'Наприклад, ви хочете, щоб чистоту в офісі підтримували зовнішні співробітники.',
  'Варіант перший: ви укладаєте з компанією договір, згідно з якого по закінченні робочого дня в офісі повинні бути помиті підлоги, '
  'а протягом дня, скажімо, тричі, зібрано весь сміття і протерта пил. Плюс щоп\'ятниці - помиті вікна.',
  'Компанія направляє до вас співробітників, які виконують всі ці роботи. Кількість співробітників визначає компанія, '
  'і завдання також вона ставить. Це - аутсорсинг.',
  'Варіант другий: ви укладаєте договір, згідно з якого компанія направляє до вашого розпорядження прибиральницю або кількох '
  'прибиральниць з 9 ранку до 18 вечора з понеділка по п\'ятницю. Ви ставите прибиральниці завдання: '
  'в кінці дня помити підлогу, а протягом дня не рідше трьох разів протерти пил і винести сміття, '
  'а по п\'ятницям помити вікна. Це - аутстаффінг.'
  ];

// Employee data Page --------------------------------------------------------

  static String employee_data_page_text = 'БЕЗКОШТОВНА БАЗА РЕЗЮМЕ СПІВРОБІТНИКІВ';
  static String employee_data_page_offer = 'Наші переваги';
  static List<String> employee_data_page_offer_more = [
    'Ми шукаємо скрізь, а не лише на двох сайтах',
    'Резюме підбираються виключно експертами з підбору персоналу',
    'Ми працюємо дуже оперативно з 12 до 24 годин',
    'Резюме підбираються строго за вашою заявкою',
    'Ми маємо власну базу актуальних резюме',
    'Ми підбираємо цільові резюме за вашою вакансією з платних сайтів'
  ];

  static String employee_data_page_finder_1 = 'Як це працює:';
  static List<String> employee_data_page_finder_1_more = [
    'Ви замовляєте безкоштовний дзвінок експерта',
    'Експерт відповідає на ваші питання, і ви повідомляєте йому вимоги до кандидатів',
    'Ви здійснюєте оплату послуги, і ми надсилаємо резюме на вашу електронну адресу'
  ];

  static String employee_data_page_finder_2 = 'Пошук резюме';
  static List<String> employee_data_page_finder_2_more = [
    'Підбір персоналу силами професійних експертів рекрутингової компанії;',
    'Зменшення витрат на покупку доступу до job сайтів;',
    'Оперативна оцінка реальної ситуації на ринку праці та рекомендації щодо зміни мотивації співробітників;',
    'Швидкість роботи - перші резюме ви отримуєте в день звернення;',
    'Ви зекономите величезну кількість часу, не перебираючи тисячі резюме.'
  ];

// Scan CV PAGE ---------------------------------------------------------------
  static String scan_cv_page_text = 'СКРІНІНГ РЕЗЮМЕ';
  static String scan_cv_page_offer =
      'Пошук здійснюється за такими характеристиками соискателя на посаду:';
  static List<String> scan_cv_page_offer_more = [
    'Вік',
    'Стать',
    'Освіта',
    'Спеціальність',
    'Досвід роботи'
  ];

  static String scan_cv_page_finder_1 = 'Наші послуги';
  static List<String> scan_cv_page_finder_1_more = [
    'Отримайте найкращі та найактуальніші резюме кандидатів',
    'Зменште витрати компанії і не шукайте резюме соискателів самостійно',
    'Користуйтеся послугами рекрутерів та консультантів для пошуку працівників за базою резюме',
    'Виберіть свого співробітника з великого чиста спеціалістів',
    'Просто ставте строки та завдання і отримуйте результат - список резюме соискателів!'
  ];
  static String scan_cv_page_finder_2 = 'Скрінінг резюме персоналу';
  static List<String> scan_cv_page_finder_2_more = [
    'Нижча вартість порівняно з рекрутингом',
    'Економія часу',
    'Оплата здійснюється не за одного соискателя, а загалом за вакансію',
    'Економія коштів на покупці доступів до кількох платних ресурсів'
  ];

//Strings Research Page ------------------------------------------------------
  static String research_page_text = 'ЕКСПРЕС-ПІДБІР ПЕРСОНАЛУ';
  static String research_page_offer = 'Економимо час і гроші:';
  static List<String> research_page_offer_more = [
    'на первинний пошук кандидатів;',
    'на телефонні дзвінки соискателям;',
    'на обробку вхідних резюме;',
    'на відбір кандидатів;',
    'на запит рекомендацій.'
  ];

  static String research_page_finder_1 = 'Експрес-підбір персоналу';
  static List<String> research_page_finder_1_more = [
    'Допомагаємо сформулювати вимоги до резюме та особистих якостей кандидатів, а також сформулювати цікаві їм умови.',
    'Відбираємо спеціалістів, які відповідають списку вимог.',
    'Зв\'язуємося по телефону з кожним, інформуємо про вільну вакансію, проводимо коротке інтерв\'ю.',
    'Резюме зацікавлених кандидатів надсилаємо вам.',
    'Зацікавлені кандидати запрошуються на співбесіду в ваш офіс.',
    'Рекрутер нашого кадрового агентства перевіряє рекомендації від попереднього керівника фінального кандидата',
    'Ресерчинг дозволяє призначити зручний час для проведення співбесід, '
        'грамотно розподілити час і уникнути незапланованих простоїв.'
  ];

  static String research_page_finder_2 = 'Переваги ресерчингу';
  static List<String> research_page_finder_2_more = [
  'Використовуємо як власну базу, так і не менше 7 відкритих і закритих інтернет-ресурсів для пошуку спеціалістів.',
  'Гарантуємо вам достовірність інформації, заявленої в резюме кандидатів.',
  'Забезпечуємо повну конфіденційність - наші спеціалісти не використовують отримані відомості про компанію в особистих цілях.',
  'Застосовуємо сучасні методи досліджень і інтерв\'ю, що дозволяють успішно вирішувати кадрові завдання будь-якої складності.',
  'Розрахунок здійснюється після того як 7 днів кандидат або кандидати працюють у вас.'
  ];

//Strings ABOUT US PAGE ------------------------------------------------------
  static String about_us_text = 'Про компанію';
  static List<String> about_us_text_more = [
    'Кадрове агентство HR-Library працює на ринку послуг з підбору персоналу. '
        'За нашою діяльністю стоїть немалий досвід. Ми не тільки спостерігали за становленням рекрутингу як галузі, '
        'але стали активними учасниками цього процесу.',
    'Ми допомогли багатьом компаніям вирішити проблему з комплектацією штату, а кандидатам - знайти стабільне місце працевлаштування.'
        'Ми не збавляли нашої активності і темпу розвитку навіть в складні періоди економічних криз, і на сьогоднішній день є '
        'визнаними експертами з підбору персоналу.',
    'Надаємо компаніям і організаціям наступні послуги:'
        'пошук співробітників на нові посади;',
    'заміна спеціаліста, оновлення штату;',
    'відкриття нових філіалів, в тому числі, в регіонах;',
    'консультування з HR питань і оцінки персоналу.',
    'HR-Library здійснює пошук персоналу та активно співпрацює з роботодавцями та кандидатами.'
  ];

  static String about_us_for_people = 'Для кого ми працюємо';
  static List<String> about_us_for_people_more = [
  'Клієнтами HR-LIBRARY є як солідні компанії з численним штатом, '
  'так і розвиваються компанії, що формують команду. Наше агентство має досвід роботи в різних сферах бізнесу - IT, '
  'будівництво, логістика, продажі, виробництво та інші напрямки.',
  'До наших послуг роботодавці звертаються як у стандартних, так і у невідкладних ситуаціях підбору, '
  'коли персонал потрібен "тут і зараз". Оперативність без втрати якості - один з основних принципів нашої роботи.'
  ];

  static String about_us_five = '5 принципів нашої роботи';
  static List<String> about_us_five_more = [
    '1. Спеціалізація за напрямами',
    '2. Широке охоплення кандидатів',
    '3. Тщательне тестування та перевірка безпеки',
    '4. Робота на результат',
    '5. Троєна гарантія'
  ];

//String Sales Manager page -------------------------------------------------
  static String sales_manager_text = 'ПІДБІР ПЕРСОНАЛУ В СФЕРІ ПРОДАЖ';
  static String sales_manager_offer_work_1 = 'Резюме за категоріями:';
  static String sales_manager_offer_work_2 = 'Підбір співробітників:';
  static List<String> sales_manager_offer_work_1_more = [
    'резюме менеджера з продажу',
    'резюме керівника з продажу',
    'резюме начальника відділу продажу',
    'резюме торгового представника',
    'резюме комерційного директора',
    'резюме директора з продажу'
  ];
  static List<String> sales_manager_offer_work_2_more = [
    'комерційний директор',
    'керівник відділу продажу',
    'менеджер з продажу',
    'менеджер з роботи з клієнтами',
    'директор з продажу',
    'торговий представник'
  ];

  static String sales_manager_finder = 'Підбір в сфері продажу';
  static List<String> sales_manager_finder_more = [
    'Найважливіше в продажах - це результат. Якщо вам потрібен менеджер з продажу, '
        'ми підберемо найефективніших і результативних співробітників.',
    'Оцінці та перевірці піддаються професійні якості та навички, результативність на попередніх робочих місцях, особисті якості.',
    'Як ми це робимо?',
    'Використовуємо власну базу кандидатів в сфері продажу. Ми маємо велику базу резюме, '
        'серед яких резюме торгового представника, резюме керівника відділу продажу, резюме комерційного директора та інших.',
    'Оцінюємо навички продажу, професійно важливі якості, моделюючи типові робочі завдання (наприклад - робота з запереченнями).',
    'Особисто зустрічаємося з роботодавцем для кращого розуміння завдань підбору спеціаліста.',


    'Шукаємо кандидатів з великої кількості джерел, включаючи ваші професійні конкуренти.'
  ];

  static String sales_manager_finder_2 = 'Чому нам довіряють?';
  static List<String> sales_manager_finder_2_more = [
    'Швидкість підбору співробітника - завжди актуальна база резюме спеціалістів.',
    'Чітке відповідність очікуванням - з точки зору досвіду, професіоналізму та особистісних характеристик.',
    'Пошук менеджера з продажу, підбір та оцінка спеціалістів в сфері продажу - це наша основна спеціалізація.',
    'Відточена система рекрутингу забезпечує оперативний підбір найпрофесійніших та результативних спеціалістів.',
    'Троєна гарантія результату - оплата лише за 100% результат!'
  ];
// Advertising Page ---------------------------------------------------------
  static String advertising_text =
      'ПІДБІР ПЕРСОНАЛУ В СФЕРІ МАРКЕТИНГУ ТА РЕКЛАМИ';
  static String advertising_offer_work_1 = 'Ми шукаємо таких спеціалістів:';
  static List<String> advertising_offer_work_1_more = [
    'Аналітик;',
    'Директор з маркетингу;',
    'Маркетолог;',
    'Бренд-менеджер;',
    'Директор з реклами;',
    'Менеджер з реклами;',
    'Інтернет-маркетолог;',
    'Event-менеджер;',
    'Контент-менеджер;',
    'Копірайтер;',
    'Менеджер з PR;',
    'PR директор.'
  ];
  static String advertising_offer_work_2 = 'Ми підбираємо персонал для:';
  static List<String> advertising_offer_work_2_more = [
    'Відділів маркетингу в складі компаній;',
    'Рекламних агентств;',
    'Маркетингових агентств;',
    'Digital-маркетингових агентств;',
    'Рекламних і PR відділів організацій.'
  ];

  static String advertising_finder_1 =
      'Персонал для відділу реклами та маркетингу';
  static List<String> advertising_finder_1_more = [
    'Одна зі спеціалізацій рекрутингового агентства HR-Library - підбір співробітників у сфері маркетингу, реклами та PR.',
    'Надаємо потрійну гарантію, що надані кандидати будуть відповідати заявленим вимогам і конкретним завданням бізнесу вашого агентства та/або відділу.'
  ];
  static String advertising_finder_2 = 'Як ми шукаємо та підбираємо спеціалістів?';
  static List<String> advertising_finder_2_more = [
  'Первинний відбір.',
  'Попередній аналіз резюме кандидатів на їх відповідність вимогам компанії-роботодавця та формування списку кандидатів. При цьому відсіюються спеціалісти, '
  'які не володіють мінімальним набором потрібних якостей.',
  'Співбесіда з кандидатом.',
  'Під час розмови оцінюються його компетенції, мотивація, прагнення до професійного зростання, вміння адаптуватися в новому колективі тощо. '
  'Кожному претенденту надається об\'єктивна інформація про роботодавця, умови праці, розміри оплати, що дозволяє об\'єктивно мотивувати кандидата.',
  'Перевірка рекомендацій.',
  'Для отримання об\'єктивної інформації про особисті та професійні якості спеціаліста проводиться бесіда з керівником, '
  'який може його охарактеризувати з професійної точки зору, з співробітниками організацій, в яких він раніше працював.',
  'Прийом на роботу.',
  'На основі аналітичних даних відбирається кандидат, максимально підходящий на вакантну посаду. '
  'З ним укладається договір у письмовій формі і призначається випробувальний термін для перевірки його працевлаштування та професійних навичок. '
  'На випробувальному терміні діє гарантія від HR-Library.'
  ];

// Top Manager Page ---------------------------------------------------------

  static String top_manager_text = 'ПІДБІР ТОП-ПЕРСОНАЛУ';
  static List<String> top_manager_work_1_more = [
    'Продажі / Сфера торгівлі / Закупівлі / ВЕД',
    'Бухгалтерія / Фінанси / Банки',
    'Реклама / Маркетинг / PR',
    'Проектування / Будівництво / Архітектура',
    'Промисловість / Виробництво',
    'Юриспруденція',
    'Інформаційні технології / Телекомунікації',
    'Транспорт / Логістика',
  ];
  static List<String> top_manager_work_2_more = [
    'Топ-персонал;',
    'Генеральний директор;',
    'Виконавчий директор;',
    'Операційний директор;',
    'Заступник директора;',
    'Директор з загальних питань;',
    'та інше'
  ];

  static String top_manager_finder = 'Пошук керівників';
  static List<String> top_manager_finder_more = [
    'Якщо вам потрібен успішний керівник з конкретного сегмента ринку, звертайтесь до кадрового агентства HR-Library.',
    'Вимоги замовника до агентства з підбору керівного персоналу надзвичайно високі. '
        'І це пояснюється, адже топ-менеджери відображають стратегію та політику компанії. '
        'Очевидно, що підбір "топів" у компанію — завдання непросте та відповідальне.',
    'Ви можете висунути будь-які вимоги та побажання до кандидата, як професійного, так і особистісного характеру. '
        'Можете бути впевнені, що всі вони будуть враховані нами в процесі підбору.'
  ];
  static String top_manager_finder_2 = 'Етапи підбору керівного персоналу:';
  static List<String> top_manager_finder_2_more = [
    'Первинний підбір, ретельний аналіз соцікандидатів;',
    'Застосування технології прямого пошуку;',
    'Складання списку кандидатів, що відповідають усім критеріям;',
    'Надання списку замовнику з подальшим вибором найбільш підходящих соцікандидатів;',
    'Організація співбесіди з кандидатами, в якій можуть приймати участь і наші співробітники;',
    'За результатами співбесіди замовник вибирає спеціаліста;',
    'Співпраця з нашим кадровим агентством забезпечує гарантію успішного підбору керівного персоналу.',
  ];

//Administration Page --------------------------------------------------------
  static String administration_text =
      'ПІДБІР СЕКРЕТАРІВ ТА АДМІНІСТРАТИВНОГО ПЕРСОНАЛУ';
  static String administration_work_offer =
      'Ми спеціалізуємося на підборі секретарів, а також допоможемо, якщо потрібен:';
  static List<String> administration_work_offer_more = [
    'Адміністратор',
    'Офіс-менеджер',
    'Особистий помічник',
    'Персональний асистент',
    'Бізнес-асистент',
    'Помічник керівника'
  ];

  static String administration_finder_1 = 'Потрібен адміністратор?';
  static List<String> administration_finder_1_more = [
    'Щоб оперативно запропонувати вам повністю підходящого спеціаліста, як тільки ми дізнаємося, що вам потрібен секретар, ми:',
    'Підтримуємо базу резюме секретарів та особистих помічників',
    'Постійно переглядаємо нові резюме офіс-менеджерів, секретарів, операторів ПК та інших спеціалістів з адміністративної роботи',
    'Проводимо постійні співбесіди з новими потенційними кандидатами, оцінюючи робочі навички та знання комп\'ютерних '
    'програм, перевіряючи інформацію з резюме та рекомендацій, проводячи психологічне тестування та моделюючи реальні робочі завдання',
    'В результаті одразу після вашого звернення з заявкою на підбір секретарів, ми:',
    'Особисто зустрічаємося з вами, щоб чітко зрозуміти, якого саме спеціаліста ви шукаєте',
    'Надаємо широкий вибір найкращих кандидатів',
    'Надаємо гарантію - у разі відходу співробітника ми оперативно підберемо для вас нового спеціаліста безкоштовно',
    'Важливо звертати увагу не тільки на досвід і навички під час пошуку секретарів, '
        'тому дізнайтеся більше про підбір секретаря - просто замовте дзвінок!'
  ];

  static String administration_finder_2 = 'Кого вам потрібно?';
  static List<String> administration_finder_2_more = [
    'Дуже часто за запитом «шукаю секретаря» керівники насправді приховують пошук досвідного адміністратора, '
        'який візьме на себе господарську частину життя всього офісу, кажучи «шукаю секретаря в офіс», у своїй голові мають на увазі особистого помічника, '
        'який буде залишатися на зв’язку цілодобово, а формулюючи вакансію як «потрібен секретар з додатковими '
        'обов’язками», мають на увазі унікальне поєднання системного адміністратора, оператора ПК, комерційного директора, офіс-менеджера '
        'та спеціаліста з продажів.',
    'На щастя, досвідчені спеціалісти HR-Library точно зможуть розібратися, що саме ви розумієте під запитом «потрібен адміністратор», '
        'і підберуть для вас саме того спеціаліста, який точно справиться з усіма покладеними на нього обов’язками.',
    'Ми готові приступити до роботи прямо зараз!'
  ];

//HR Page new ----------------------------------------------------------------
  static String hr_page_text =
      'ПІДБІР СПЕЦІАЛІСТІВ У СФЕРІ УПРАВЛІННЯ ПЕРСОНАЛОМ';
  static List<String> hr_page_offer_more_1 = [
    'HR-директор;',
    'Менеджер з персоналу (HR);',
    'Тренінг-менеджер;',
    'Менеджер з розвитку персоналу;',
    'Менеджер з навчання;',
    'Рекрутер;',
    'HR-генераліст;',
    'HR-бізнес-партнер.'
  ];
  static List<String> hr_page_offer_more_2 = [
    'HR-підрозділи великих компаній;',
    'HR-відділи;',
    'Філіали;',
    'IT-компанії;',
    'Транспортні компанії;',
    'Будівельні компанії;',
    'Фінансовий сектор;',
    'та інше.'
  ];

  static String hr_page_finder_1 = 'Підбір HR-спеціалістів';
  static List<String> hr_page_finder_more_1 = [
  'Потрібен менеджер з підбору персоналу? Спеціалісти кадрового агентства HR-Library готові максимально швидко '
  'та якісно вирішити кадрову проблему. Більше 16 років ми займаємося відбором резюме справжніх професіоналів '
  'і заповненням вакансій у всіх напрямках HR-сфери:',
  'підбір та адаптація співробітників;',
  'кадрове документообіг та адміністрування;',
  'навчання персоналу та проведення тренінгів;',
  'розробка бізнес-процесів компанії;',
  'кар\'єрне планування та розвиток персоналу;',
  'формування та підтримка HR-бренду;',
  'підтримка керівників підрозділів у питаннях HR тощо.',
  'За кожною компетенцією у нас є наші власні експерти, які мають значний практичний '
  'досвід у пошуку та підборікандидатів, здатних грамотно оцінити як професійні якості менеджера з навчання персоналу, '
  'так і HR-директора з персоналу.',
  'Ми впевнені, що професійні спеціалісти у сфері управління персоналом здатні суттєво вплинути на показники компанії, '
  'зробити колектив єдиною командою, зменшити текучість персоналу та створити оптимальну систему мотивації '
  'та адаптації персоналу.'
  ];
  static String hr_page_finder_2 = 'Принципи підбору HR-спеціалістів';
  static List<String> hr_page_finder_more_2 = [
    'Спеціалісти кадрового агентства HR-Library ретельно підходять до виконання своєї роботи, '
        'не вважаючи її закінченою після підбору та працевлаштування кандидата. '
        'Протягом всього випробувального терміну ми супроводжуємо його та компанію клієнта, визначаючи, які вимоги виконані, '
        'а які не вдалося здійснити та з яких причин. Для цього обов\'язково проводимо:',
    'консультаційні зустрічі;',
    'моніторинг вирішення поставлених завдань;',
    'контролюємо процес адаптації спеціаліста.',
    'Таким чином, ми завжди своєчасно реагуємо на зміну ситуації та швидко вирішуємо виникаючі проблеми. '
        'У кінцевому підсумку, такий підхід дозволяє нам гарантувати ефективність роботи підібраного нами співробітника та задоволення '
        'всіх вимог роботодавця.',
    'Залиште заявку, спеціалісти кадрового агентства HR-Library підберуть кваліфікованих HR-спеціалістів, '
    'які справді люблять і знають свою справу, успішно застосовують сучасні кадрові технології.'
  ];

// Engineer Page -------------------------------------------------------------
  static String engineer_text = 'ПІДБІР ІНЖЕНЕРІВ І ТЕХНІЧНИХ СПЕЦІАЛІСТІВ';
  static List<String> engineer_offer_1_more = [
    'Головний інженер;',
    'Інженер ПТО;',
    'Менеджер з якості;',
    'Менеджер проекту;',
    'Керівник виробництва;',
    'Енергетик;',
    'Технічний директор;',
    'та інші.'
  ];
  static List<String> engineer_offer_2_more = [
    'Торгівля;',
    'Будівництво;',
    'Виробництво;',
    'Логістика;',
    'Видобуток та переробка ресурсів;',
    'Банки та лізингові компанії;',
    'IT та інноваційні організації;',
    'та інші.'
  ];

  static String engineer_finder_1 = 'Як знайти інженера?';
  static List<String> engineer_finder_1_more = [
    'Вам потрібен висококваліфікований та досвідчений інженер? Замовте пошук відповідного спеціаліста '
        'у нашій компанії за найвигідніших умов:',
    'За доступною та повністю обґрунтованою ціною;',
    'Оперативно;',
    'З офіційними гарантіями;',
    'Повноцінним інформативним супроводом на всіх етапах пошуку, відбору та проходження кандидатом випробувального терміну.',
    'Ми забезпечимо ефективну економію, як часового, так і матеріального ресурсу, позбавимо Вас і Ваших кадровиків '
        'від будь-яких можливих ризиків, невдач чи помилок.',
    'Наші досвідчені рекрутери застосовують найкращі світові практики і методики відбору профільних спеціалістів, '
        'тому нашим клієнтам ми надаємо лише найбільш гідних кандидатів.',
    'Власна розширена база кандидатів і регулярний моніторинг ринку праці дозволяє нам своєчасно відбирати тільки '
    'найкращих професіоналів, причому в рекордно короткі терміни.',
    'Якщо Ви вже готові запропонувати роботу інженером потенційним кандидатам, заповніть заявку на дзвінок.'
  ];
  static List<String> engineer_finder_2_more = [
    'Абсолютна конфіденційність',
    'Максимально збільшені можливості пошуку необхідного профі',
    'Якщо потрібний інженер без досвіду роботи, ми готові провести відбір відповідних кандидатів серед випускників кращих ВНЗ',
    'Безкоштовний аналіз поточної ситуації потрібного напрямку на ринку праці, моніторинг зарплат, премій, '
        'бонусів для соискателей конкретного рівня',
    'Перевірка достовірності наданих соискателем даних, в тому числі рекомендаційних листів з попередніх місць працевлаштування, '
        'перевірка кандидатів власним службою безпеки'
  ];

// Building Page ----------------------------------------------------------
  static String building_text =
      'ПІДБІР КЕРІВНИКІВ ТА СПЕЦІАЛІСТІВ У БУДІВЕЛЬНІЙ СФЕРІ';
  static List<String> building_offer_1 = [
    'прораб;',
    'інженер ПТО;',
    'кадастровий інженер;',
    'інженер-проектувальник;',
    'інженер-конструктор;',
    'ГІП та ГАП;',
    'директор з будівництва;',
    'генеральний директор.'
  ];
  static List<String> building_offer_2 = [
    'будівництво об\'єктів;',
    'будівництво теплотехнічних об\'єктів;',
    'будівництво енергетичних об\'єктів та систем;',
    'введення та проектування інженерних мереж;',
    'проектування технічних об\'єктів;',
    'та інше.'
  ];

  static String building_finder_1 = 'Підбір персоналу у будівельній сфері';
  static List<String> building_finder_more_1 = [
  'Скориставшись нашою послугою, ви зможете поповнити свій штат кваліфікованим спеціалістом, '
  'здатним ефективно вирішувати поставлені завдання та працювати на успіх всієї компанії.',
  'У процесі пошуку нового співробітника на відкриту вакансію ми:',
  'вивчаємо доступні бази з резюме для виявлення підходящих кандидатів;',
  'проводимо тестування та анкетування соискателів для визначення рівня володіння професійними навичками;',
  'перевіряємо наявність у фахівців необхідних допусків та сертифікатів;',
  'складаємо докладні рекомендації на кандидатів.',
  'Для пошуку персоналу ми використовуємо як традиційні методи підбору - публікації оголошень у газетах та опитування знайомих, '
  'так і такий надійний спосіб, як відбір співробітників на профільних та закритих інтернет-ресурсах.',
  'Комплексний підхід дозволяє нам підбирати потрібного фахівця в максимально стислі терміни '
  'та надавати гарантію його заміни протягом 2-х років.'
  ];
  static String building_finder_2 = 'Як ми працюємо?';
  static List<String> building_finder_more_2 = [
    'Узгодження замовником заявки на підбір спеціаліста.',
    'Підписання офіційного договору.',
    'Пошук резюме в власній базі спеціалістів та закритих інтернет-джерелах.',
    'Первинний відбір кандидатів відповідно до вимог.',
    'Перевірка рекомендацій фахівця з попередніх місць роботи.',
    'Співбесіда співробітника відділу HR-Library з соискателями.',
    'Тестування кандидатів за унікальними методиками.',
    'Надання списку відібраних спеціалістів замовнику.'
  ];

  // Logistics Page ----------------------------------------------------------
  static String logistics_text =
      'ПІДБІР ПЕРСОНАЛУ У СФЕРІ ТРАНСПОРТНОЇ ТА СКЛАДСЬКОЇ ЛОГІСТИКИ';
  static List<String> logistics_offer_1_more = [
    'кладовщик;',
    'начальник відділу логістики;',
    'логіст;',
    'керівник відділу логістики;',
    'начальник складу;',
    'топ-персонал;',
    'директор з логістики;',
    'начальник транспортного відділу;',
    'менеджер з продажу логістичних послуг.'
  ];
  static List<String> logistics_offer_2_more = [
    'у логістичних компаніях;',
    'у логістичних підрозділах;',
    'у транспортних компаніях;',
    'у портах та стивідорних компаніях;',
    'у терміналах;',
    'у сфері роздрібної торгівлі.'
  ];

  static String logistics_finder_1 = 'Підбір персоналу';
  static List<String> logistics_finder_1_more = [
    'Завдяки власній базі, яка налічує сотні професіоналів, та тривалій практиці, '
        'ми оперативно замикати вакансії на будь-які посади:',
    'рядових посад: логістів, диспетчерів або водіїв;',
    'керівних посад: генеральних директорів для транспортних компаній, директорів з логістики, начальників відділів та підрозділів.',
    'Звернувшись до нас, ви отримаєте мотивованого професіонала у логістиці!',
    'За роки роботи ми детально вивчили існуючі вимоги на ринку складської та транспортної логістики, '
        'тому надаємо лише кваліфікованих спеціалістів з потрібними професійними знаннями та особистісними якостями.'
  ];
  static String logistics_finder_2 = 'Принципи підбору логістів';
  static List<String> logistics_finder_2_more = [
    'Сьогодні грамотний і досвідчений логіст - затребуваний фахівець на ринку праці, '
        'який досить швидко знаходить відповідну для нього компанію. Тому підібрати такого співробітника надзвичайно складно, '
        'не використовуючи як сучасні, так і перевірені часом методи.',
    'Тому під час пошуку кваліфікованого логіста ми не тільки вивчаємо резюме кандидатів, '
        'але й використовуємо десятки критеріїв, які визначаємо з урахуванням вимог замовника та кола обов\'язків спеціаліста. Серед них:',
    'особисті якості кандидата, такі як порядність, відповідальність, акуратність і чесність;',
    'його здатність оптимізувати існуючі та складати нові ефективні транспортні схеми;',
    'наявний у нього практичний досвід у галузі логістики;',
    'здатність орієнтуватися в нових логістичних концепціях та бізнес-процесах;',
    'його вміння аналізувати та прогнозувати ситуацію.'
  ];

// Employee Page  ------------------------------------------------------
  static String worker_page_text = 'ПІДБІР РОБОЧОГО ПЕРСОНАЛУ';
  static List<String> worker_page_offer_1 = [
    'зварювач;',
    'вантажник;',
    'монтажник;',
    'водій;',
    'універсал;',
    'механік;',
    'електрик;',
    'упаковувальник;',
    'збирач;',
    'фасувальник;',
    'слюсар і ін.'
  ];
  static List<String> worker_page_offer_2 = [
    'будівництво і реконструкція;',
    'виробництво;',
    'монтажні та зварювальні роботи;',
    'роздрібна торгівля;',
    'складські термінали;',
    'міжнародні та внутрішні вантажоперевезення;',
    'та інше.'
  ];

  static String worker_page_finder_1 = 'Підбір робочого персоналу';
  static List<String> worker_page_finder_more_1 = [
  'Скориставшись нашою послугою з підбору робочого персоналу, ви зможете не відволікатися від вирішення основних бізнес-задач '
  'і не витрачати цінний час на пошук, відбір і оформлення лінійного персоналу.',
  'Наші професійні рекрутери повністю візьмуть процес підбору робітників на себе, докладно виконають кожний етап рекрутингу:',
  'визначать ваші вимоги до працівників;',
  'здійснюють пошук кандидатів, використовуючи безліч джерел і нашу базу;',
  'ретельно відбирають найкращих працівників;',
  'надають вам повністю підходящих співробітників;',
  'виводять їх на роботу.',
  'При цьому ми збираємо важливі дані про кандидата: наявність судимості, адміністративних порушень, освіту, адресу реєстрації; '
  'відсутність шкідливих звичок, сімейний стан, стан здоров\'я. '
  'Їх перелік може змінюватися залежно від специфіки вакансії, відкритої в компанії.',
  'При підборі робітників ми застосовуємо відточену роками методику, яка дозволяє швидко знаходити та вибирати ідеально підходящих співробітників, '
  'здатних виконувати поставлені завдання.'
  ];
  static List<String> worker_page_finder_more_2 = [
    'Гарантоване відсіювання "групи ризику".',
    'Серед кандидатів на робочі спеціальності особливу категорію складають претенденти, '
        'здатні доставити різні труднощі керівництву при спільній роботі. '
        'До них відносяться проблемні та постійно незадоволені кандидати.',
    'Дотримання конфіденційності.',
    'Наші рекрутери ніколи не розголошують отриману інформацію про кадрові потреби компанії клієнта, '
        'включаючи кількість відкритих вакансій і розмір заробітної плати робітників.',
    'Вирішення завдань будь-якої складності.',
    'Ми є професіоналами своєї справи та підбираємо робочий персонал навіть таких рідкісних спеціальностей, '
        'як столяр, піскоструйник, промисловий альпініст і шафер.',
    'Ретельний пошук.',
    'Наші рекрутери займаються пошуком робочого персоналу скрізь. Ми шукаємо працівників не тільки в газетах і Інтернеті. '
        'Ми беремо участь у ярмарках вакансій, у профільних виставках і, звичайно, шукаємо за рекомендаціями.'
  ];

// FinancierPage ----------------------------------------------------
  static String financier_text = 'ПІДБІР ПЕРСОНАЛУ В СФЕРІ ФІНАНСІВ';
  static String financier_offer_1 = 'Спеціалізуємося на підборі:';
  static List<String> financier_offer_1_more = [
    'бухгалтер;',
    'головний бухгалтер;',
    'фінансовий директор;',
    'аудитор;',
    'економіст;',
    'фінансовий менеджер;',
    'головний бухгалтер;',
    'бухгалтер по ділянках;',
    'бухгалтер на первинну документацію;',
    'та інше.'
  ];
  static List<String> financier_offer_2_more = [
    'Виробництво',
    'Будівництво',
    'Оптова торгівля',
    'Роздрібна торгівля',
    'Послуги',
    'Логістика та транспорт',
    'Банки та страхові компанії',
    'Освіта та наукові дослідження',
    'Громадське харчування',
    'Управлінські компанії'
  ];

  static String financier_finder_1 = 'Знайдемо потрібного спеціаліста';
  static List<String> financier_finder_1_more = [
  'Як показує практика, самостійний пошук не завжди дає бажаний результат і, як правило, '
  'забирає достатньо багато часу.',
  'Тому ми створили спеціальний відділ, HR-менеджери якого швидко і якісно знаходять персонал, як для великих страхових, '
  'фінансових та інвестиційних компаній, так і для невеликих організацій.',
  'Сьогодні в нашій базі зберігаються багато резюме, які мають необхідний досвід і кваліфікацію.',
  'Якщо вам потрібний головний бухгалтер, начальник ПЕО, фінансовий директор, аудитор - залишайте заявку в кадрове агентство HR-Library. '
  'Ми завжди готові надати гідний вибір професійних кандидатів.'
  ];
  static List<String> financier_finder_2_more = [
    'Перед співбесідою ми ретельно вивчаємо резюме кандидатів. За допомогою декількох етапів вибираємо найбільш підходящих.',
    'Завжди відбираємо кілька фінальних кандидатів, враховуючи їх психологічну сумісність з керівником, '
        'уміння доводити роботу до кінця, перевіряти себе, брати на себе відповідальність та бути лояльним співробітником для '
        'компанії-роботодавця.',
    'Такий підхід дозволяє нам гарантувати 100% позитивний результат та оперативне закриття вакансії.',
    'Кадрове агентство HR-Library - економія часу та гарантія закриття вакансії в мінімальні терміни.',
    'Залишайте заявку, співробітники нашого спеціалізованого відділу з пошуку персоналу в фінансовій сфері будуть раді допомогти в будь-який час!'
  ];

  //Strings IT employee page --------------------------------------------------
  static String it_employee_text = 'ПІДБІР ПЕРСОНАЛУ В IT-СФЕРІ';
  static String it_employee_offer_work = 'Ми підбираємо таких спеціалістів:';
  static List<String> it_employee_offer_more_1 = [
    'програміст Java;',
    'програміст Python;',
    'програміст Scala;',
    'програміст JavaScript;',
    'програмісти C++ і C#;',
    'спеціаліст з захисту інформації;',
    'системний адміністратор;',
    'тестувальник ПЗ;',
    'SMM спеціаліст;'
  ];
  static List<String> it_employee_offer_more_2 = [
    '1С програмісти;',
    'начальник відділу ІТ;',
    'SEO-оптимізатор;',
    'директолог;',
    'адміністратор баз даних;',
    'HTML-верстальник;',
    'веб-дизайнер;',
    'менеджер інтернет-проектів;',
    'контент-менеджер.'
  ];

  static String it_employee_finder = 'Підбір IT-персоналу';
  static List<String> it_employee_finder_more = [
  'Відбираємо лише кваліфікованих ІТ-спеціалістів, здатних працювати на результат і ефективно вирішувати поставлені перед ними завдання. '
  'У процесі багатоступінчатого відбору використовуємо як класичні, так і передові методи підбору персоналу:',
  'інтерв\'ювання кандидатів з відеофіксацією;',
  'тестування претендентів для оцінки рівня їх професіоналізму;',
  'перевірку рекомендацій колег, керівників або партнерів соискателя.',
  'Ми надаємо дворічну гарантію на закриту вакансію і безкоштовно забезпечуємо заміну обраному кандидату, '
  'якщо він не пройде випробувальний термін або звільниться за власним бажанням.',
  'Ви сплачуєте прихід в вашу компанію лише тих спеціалістів, які готові працювати з вами довго. '
  'І не витрачаєте час і кошти на непотрібних і недомотивованих співробітників.'
  ];

  //Strings mass recruitment page ----------------------------------------------

  static String mass_recruitment = 'МАСОВИЙ ПІДБІР ПЕРСОНАЛУ';
  static String with_us = 'З нами ви зможете';
  static List<String> with_us_more = [
    'Швидко й легко закривати однотипні вакансії',
    'Планувати бюджет на тривалий період',
    'Насолоджуватися оптимальною ціною на масовий підбір персоналу'
  ];
  static String how_mach = 'Дізнайтеся вартість';
  static String why_hr_lib = 'Чому HR LIBRARY?';
  static List<String> why_hr_lib_more = [
    'Наші технології масового підбору персоналу перевірені на сотнях проектів',
    'Завжди велика кількість підходящих кандидатур',
    'Гнучке управління процесом пошуку співробітників',
    'Постійний і обсяжний потік соискателів – знімається проблема "течії кадрів"',
    'Оперативна корекція вакансій залежно від потреб',
    'Економія часу завдяки передачі завдання професіоналам'
  ];
  static String mass_recruitment_text = 'МАСОВИЙ ПІДБІР ЛІНІЙНОГО ПЕРСОНАЛУ –';
  static String mass_recruitment_text_more =
      'це відбір співробітників середнього рівня та робітничих спеціальностей з формальними вимогами'
      ' до соискателів. Це великий проект, що має кілька етапів: попередня підготовка, '
      'первинний відбір і супроводження штатного персоналу.'
      'Подібні заходи потребують великих часових і кадрових витрат. '
      'Рекрутингове агентство HR LIBRARY знає все про те, що таке масовий підбір персоналу. '
      'Ми знайдемо і відберемо співробітників за формальними вимогами з метою закриття великої кількості однотипних лінійних вакансій '
  'у короткий час.';

  static String mass_rec_price_validate =
      'Ціна масового підбору персоналу залежить від:';
  static List<String> mass_rec_price_validate_more = [
    'Тривалості кампанії',
    'Кількості вакансій',
    'Кількості вимог до соискателів'
  ];


  static List<String> it_employee_what_more = [
    'HR-LIBRARY постійно відстежує стан ринку праці в галузі IT-сектора',
    'Активно беруть участь у різних конференціях та заходах, присвячених інформаційним технологіям',
    'Вдосконалюють свої навички підбору IT-спеціалістів',
    'Бажаєте знайти висококласного ІТ-спеціаліста в свою команду?',
    'Телефонуйте і залишайте заявку на підбір потрібного кандидата.'
  ];

  //Strings Executive Search ----------------------------------------------------
  static String executive_search =
      'EXECUTIVE SEARCH - ТОЧКОВИЙ ПІДБІР ІДЕАЛЬНИХ СПЕЦІАЛІСТІВ';
  static String why_this_method = 'Переваги методу:';
  static List<String> why_executive_search_more = [
    'Конфіденційність: нерозголошення факту переговорів — одна з важливих умов;',
    'Індивідуальний підхід: ми вміємо «підлаштовуватися» під особливості клієнта;',
    'Аргументація: якщо спеціаліст не шукає роботу, ми зможемо побудувати діалог;',
    'Спеціалізація: у нас є експерти у галузі, в якій проводиться підбір;',
    'Особисті комунікації: ми маємо корисні контакти для пошуку та рекомендацій;',
    'Увага до дрібниць: враховуємо будь-які ваші запити та вимоги.'
  ];

  static String executive_search_complex = 'Комплексний Executive Search';
  static List<String> executive_search_complex_more = [
    'В першу чергу ми визначаємо вимоги до навичок і досвіду, якими повинен володіти кандидат.',
    'Обов\'язково формуємо список тих, хто задовольняє всім критеріям замовника, '
        'звертаючи увагу на результативність спеціалістів і їх показники при роботі в інших компаніях.',
    'Проводимо співбесіди з використанням комплексних методик, що дозволяють визначити рівень кваліфікації, '
        'досягнення, професійні навички, досвід роботи і психологічний портрет претендентів.',
    'Мотивуємо кандидатів, які цікавлять замовника, на перехід у його компанію.',
    'Такий комплексний підбір займає від двох тижнів до півтора місяців і залежить від складності вакансії,'
    ' а також вимог, які пред\'являються до співробітника.'
  ];

  static String executive_search_what = 'EXECUTIVE SEARCH –';
  static String executive_search_what_more =
      'унікальна послуга, надається рекрутерами агентства HR Library. '
      'У нашому розпорядженні є обширна база резюме досвідчених менеджерів вищого рівня, '
      'що дозволяє оперативно підбирати топ-персонал у будь-якій професійній сфері. Залучаючи кваліфіковану команду експертів, '
      'що складається з аналітика, консультанта Executive Search та асистента, ми гарантуємо замовникам точність підбору персоналу і результат, '
      'який відповідає всім вимогам.'
      'Якщо відповідного топ-менеджера немає в нашій базі, ми формуємо список компаній, в яких можуть працювати цікавлять '
      'замовника спеціалісти. Додатково складаються звіт про ситуацію, склалася на ринку праці в даній галузі, зарплатний відрізок '
      'за вакансію і список потенційних кандидатів, здатних отримати в перерахованих компаніях необхідні знання, зв\'язки і досвід.';

  static String executive_search_price = 'EXECUTIVE SEARCH З HR LIBRARY - ЦЕ:';
  static List<String> executive_search_price_more = [
    '2-річна гарантія того, що знайдений топ відповідає всім вашим побажанням і підходить для даної роботи',
    'Безкоштовна заміна обраного кандидата, якщо з якоїсь причини він не підійде',
    'Вартість Executive Search від 18% до 24% від очікуваного річного доходу керівника'
  ];

  //Strings RECRUITMENT -------------------------------------------------------

  static String recruitment_text = 'ПІДБІР ПЕРСОНАЛУ';

  static String recruitment_what_offer = 'Що включає послуга підбору персоналу';
  static List<String> recruitment_what_offer_more = [
    'Аналіз ринку праці для вашої вакансії',
    'Професійного рекрутера зі знанням вашої галузі',
    'Доступ до закритих баз та джерел резюме',
    'Охоплення всього ринку кандидатів',
    'Оцінка максимальної кількості резюме',
    'Формування бланку перевірених рекомендацій кандидата',
    'Економія особистого часу',
    'Строге дотримання термінів підбору'
  ];

  static String recruitment_problem = 'Актуальні проблеми підбору персоналу';
  static List<String> recruitment_problem_more = [
    'Кадровий парадокс періоду пандемії та віддаленої роботи - складності з пошуком спеціалістів при значній кількості кандидатів.',
    'Якісний рекрутинг - це не формальне закриття вакансії, а підбір потрібного спеціаліста. '
        'HR-тренд сучасності: краще один професіонал, ніж повний відділ незнайок.',
    'Оптимізація витрат на персонал - це не відмова від послуг HR-агентства, а вкладення грошей з максимальною користю. '
        'Спроба заощадити на послугах рекрутингового агентства призводить до збитків у перспективі. '
        'Витрати на пошук, адаптацію, навчання, звільнення, текучість некомпетентних кадрів - це ті непродуктивні збитки, '
        'яких можна і потрібно уникнути.'
  ];

  static String recruitment_how_work = 'Як ми підбираємо персонал?';
  static List<String> recruitment_how_work_more = [
  'Для підбору кваліфікованого персоналу нам необхідно:',
  'Скласти профіль посади даної позиції та створити професійну презентацію вакансії;',
  'Залучити всі джерела пошуку, що означає розміщення вакансії на всіх доступних ресурсах,'
  ' а також дзвінок претендентам за відкритими та закритими базами резюме. Крім того, ми використовуємо власні бази соискателей, '
  'та інші можливі канали пошуку;',
  'Здійснити грамотний первинний відбір на основі телефонних інтерв\'ю та онлайн-тестування;',
  'Оцінити та перевірити кандидатів, що пройшли попередній етап відбору і запрошені на особисту зустріч. '
  'Наші рекрутери та експерти проводять з ними інтерв\'ю в офісі HR-Library;',
  'Зібрати рекомендації з попередніх місць працевлаштування кандидатів, перевірити їх за всіма критеріями безпеки;',
  'Вибрати та представити клієнту найкращих кандидатів, обґрунтувавши наш вибір розгорнутими коментарями;',
  'Допомогти зробити остаточний вибір.'
  ];

  static List<String> recruitment_what_more = [
    'Конфіденційність при роботі над проектами - це важливо!',
    'Шукаємо скрізь, а не на двох сайтах! Залучаємо базу, мережу рекомендацій, мережу колег у інших рекрутингових агентствах, '
        'прямий пошук, форуми, виставки, професійні спільноти, соціальні мережі та більше 10 профільних сайтів.',
    'Здійснюємо безкоштовний моніторинг ринку праці.',
    'Наполегливо дізнаємося рекомендації на кожного кандидата від його безпосереднього керівника',
    'Любимо вирішувати складні HR завдання!'
  ];

  //Strings STAFF OUTSOURCING -------------------------------------------------

  static String staff_out_text = 'АУТСОРСИНГ ПЕРСОНАЛУ';
  static List<String> staff_out_more = [
    'Сконцентруйтеся на виконанні основних цілей бізнесу, не займаючись питаннями залучення персоналу, облаштування робочих місць тощо.',
    'Зменште фінансові витрати компанії в цілому.',
    'Підвищте ефективність роботи підприємства завдяки кваліфікованим спеціалістам, які здатні вирішувати складні завдання.',
    'Звільніть бухгалтерський штат від необхідності оформлення працівників та нарахування заробітної плати.',
    'Розвивайте нові бізнес-напрямки завдяки звільненню людських і фінансових ресурсів.'
  ];

  static String staff_out_why = 'Аутсорсинг';
  static List<String> staff_out_why_more = [
  'Потрібні справжні професіонали для тимчасової, але дуже відповідальної роботи? '
  'Скористайтеся нашою послугою аутсорсингу робочого персоналу, яка дозволяє вирішити проблему пошуку спеціалістів з найменшими ризиками. '
  'Ми надамо потрібних співробітників для постійної, тимчасової або вахтової роботи, '
  'які повністю задовольнятимуть ваші вимоги як з професійної, так і з психологічної точки зору.',
  'Особливо вигідний аутсорсинг персоналу в ситуаціях, коли потрібно швидко найняти велику кількість спеціалістів. '
  'У цьому випадку всі обов\'язки з набору співробітників, навчання, перевірки їх досвіду і надійності покладаються на наших менеджерів, '
  'що дозволяє вам спокійно займатись своїми справами і не витрачати зайвий час.'
  ];

  static String staff_out_is = 'ОРЕНДА АБО АУТСОРСИНГ ПЕРСОНАЛУ –';
  static String staff_out_is_more =
      'один з прогресивних інструментів управління кадровими ресурсами. '
      'Широко використовується багатьма успішними і процвітаючими компаніями. '
      'Він дозволяє залучати потрібних спеціалістів лише на певний час, наприклад, для проведення рекламної кампанії '
      'або подання податкової звітності.';

  static String staff_out_what = 'А що ще?';
  static List<String> staff_out_what_more = [
    'Обширна база даних.',
    'Оперативна заміна персоналу.',
    'Оформлення всієї дозвільної документації для роботи співробітників.',
    'Оплата послуги на підставі акта виконаних робіт.',
    'Використовуючи наші ресурси, ви зможете швидко розширити ваш бізнес без особливих витрат. '
        'Наше кадрове агентство надає лише висококваліфікований персонал, '
        'підбираючи оптимальні варіанти співпраці та стислі терміни виконання заявки.',
    'Зателефонуйте, щоб дізнатися вартість аутсорсингу персоналу в нашій компанії. '
        'Спеціалісти HR-LIBRARY оперативно підготують індивідуальний прайс-лист, максимально враховуючи потреби компанії '
        'і ваші особисті запити.'
  ];

  //Strings HEAD HUNTING ----------------------------------------------------------------------
  static String head_hunting_text = 'ХЕДХАНТИНГ';
  static List<String> head_hunting_why_more = [
    'Методи хедхантингу в нашому агентстві не кидають тіні на замовника, оскільки конфіденційність є основою нашої співпраці.',
    'Хедхантинг допомагає компанії взяти успішний досвід конкурента і впровадити його у себе, але якщо переманювати напряму, '
        'ухиляючись від агентства, можна отримати різні проблеми.',
    'Технології хедхантингу дозволяють докладно вивчити кандидатів, скласти їх професійну та психологічну характеристику, '
        'дізнатися, що може їх мотивувати, зацікавити, ради чого вони готові будуть змінити роботу.',
    'Після визначення одного-двох потенційних спеціалістів проводяться співбесіди з кожним з них. '
        'Переманювати співробітників з інших організацій - справа клопітна і тривала, але в результаті ви отримуєте '
        'саме такого професіонала, про якого мріяли, і який відповідає всім вашим критеріям.'
  ];

  static String head_hunting_why_need = 'Чому потрібно перманювати співробітників?';
  static List<String> head_hunting_why_need_more = [
    'Найчастіше такими послугами користуються для підбору спеціалістів високого рівня, '
        'а також тих, у кого досить вузький профіль і рідка професія. Зазвичай такі люди не цікавляться вакансіями на job-сайтах. '
        'Хедхантинг використовує безліч підступів і хитрощів для того, щоб ви отримали потрібну вам людину.',
    'Що таке хедхантинг? Він дозволяє привернути на роботу професіоналів з необхідними знаннями та досвідом, '
    'які можуть принести суттєву користь вашому підприємству, але не шукають роботу на даний момент.'
  ];

  static String head_hunting_is = 'ХЕДХАНТИНГ -';
  static String head_hunting_is_more =
      'це інструмент, який дозволить вам знайти цінний кадр, якщо неможливо залучити його стандартними '
      'методами. Він допоможе тоді, коли ви точно знаєте, кого вам потрібно переманити. '
      'Хедхантинг - це переманювання конкретного успішного спеціаліста у конкурентів. Якщо ви не знаєте, кого хочете, '
      'і вам цікаві кандидати з цілого спектру компаній, - то це Executive search. '
  'Ми з однаковим успіхом виконаємо будь-яку з цих послуг для вас. '
  'Наша рекрутингова компанія пропонує хантинг персоналу, який навіть не замислюється про зміну роботи. Ми переманимо його до вас.';

  static String head_hunting_guarantee = 'ТРОЙНА ГАРАНТІЯ:';
  static List<String> head_hunting_guarantee_more = [
    'Гарантія ефективності співробітника - Повертаємо гроші, якщо підібраний нами співробітник працює неефективно.',
    'Гарантія швидкості підбору - Підходящий вам спеціаліст стане співробітником вашої компанії в найкоротші терміни.',
    'Гарантія заміни співробітника - У випадку відходу співробітника під час випробувального терміну ми оперативно підберемо '
        'для вас нового спеціаліста безкоштовно.'
  ];

  //Strings home page ----------------------------------------------------------

  static String offer_our_title = 'ПОСЛУГИ';
  static String employee_agency_title = ' КАДРОВОГО АГЕНТСТВА';

  static String opinion_personal = 'Досвід підбору\n     персоналу';
  static String success_work = 'Успішні кейси';
  static String personal_save = 'Гарантія на персонал';
  static String button_for_company_home = 'Підбір Персоналу';
  static String button_for_hr_home = 'Співробітникам';

  static String set_offer = 'ЗАЛИШИТИ ЗАЯВКУ';
  static String set_offer_free_consultation = 'на безкоштовну консультацію';
  static String offer_home_page_text = 'Розвиваємося разом з вами!';
  static String offer_home_page_more_text =
      'Кадрове агентство з підбору персоналу «HR-Library» здійснює пошук не тільки в Києві '
      'та по всій Україні, але й в країнах СНД та Європи. '
      'Наше агентство спеціалізується на пошуку та підборі кваліфікованих працівників, керівників підрозділів '
      'та топ-менеджерів для всіх галузей бізнесу. Крім класичних рекрутингових інструментів, ми використовуємо складні хантингові технології '
      'та executive search. '
      'У нашій команді працюють виключно експерти в галузі рекрутингу. '
      'Наявність підрозділів з галузевими спеціалізаціями дозволяє оперативно знаходити та '
      'оцінювати персонал за різними професійними напрямками. З вашою заявкою буде працювати рекрутер, '
      'який знає специфіку вашого бізнесу та має належний досвід в необхідній спеціалізації. '
      'Звертаючись до рекрутингового агентства «HR-Library», ви отримуєте досвід і знання кращих експертів галузі! '
      'Рекрутингове агентство «HR-Library» - це команда професіоналів, давно зарекомендувавших '
      'себе в галузі кадрових рішень. Ми вміємо шукати і знаходити, нас довіряють, до нас повертаються, нас рекомендують!';

  static String why_we_best = 'У чому переваги агентства HR-Library?';


  static String why_we_title_1 = 'Спеціалізація напрямків рекрутингу';
  static String why_we_about_1 =
      'Ми створили профільні відділи, де з вашим замовленням працюють експерти '
      'з різних галузей і сфер бізнесу: IT, Фінанси, Облік і звітність, Маркетинг, Продажі, Логістика, Промисловість тощо. '
      'У кожному з галузевих напрямків над закриттям вакансій працюють виключно професіонали з відповідним досвідом, '
      'тобто мають практичний досвід саме в даній галузі, добре знайомі з особливостями підбору персоналу.';

  static String why_we_title_2 = 'Максимальне охоплення ринку праці';
  static String why_we_about_2 =
      'У роботі над вашим замовленням ми задіяли понад 50 джерел пошуку потенційних працівників. '
      'Для пошуку та підбору, крім власної бази агентства, ми використовуємо платні ресурси, соціальні мережі, бізнес-портали, '
      'професійні форуми, галузеві конференції та інші джерела. Ми вміємо знаходити там, де інші агентства навіть не шукають!';

  static String why_we_title_3 = 'Працюємо без передоплати!';
  static String why_we_about_3 =
      'Навіть якщо вакансію буде закрито вами самостійно, ми не вимагаємо виплати неустойки. '
      'Наша обов\'язковість - підбір кадрів для вашого бізнесу, а не просто продаж послуг. '
  'Якщо ви знайшли персонал самостійно - чудово!';

  static String why_we_title_4 = 'Ексклюзивна база працівників';
  static String why_we_about_4 =
      'Наше рекрутингове агентство має актуальну і структуровану базу спеціалістів '
      'по конкретним посадам і напрямкам. База постійно оновлюється даними про працівників компаній різних галузей, '
      'зокрема фахівців вимогливих напрямків. Це дозволяє нам обробляти замовлення швидко і з '
      'максимальним результатом, знаходити та надавати перших кандидатів вже через добу. '
      'Завдяки цьому наше агентство закриває вакансії оперативніше інших, а компетенції підібраного нами персоналу '
      'максимально відповідають заявці роботодавця.';

  static String why_we_title_5 = 'Контроль надійності та безпеки';
  static String why_we_about_5 =
      'На відміну від інших кадрових агентств, при закритті вакансії ми приділяємо особливу увагу '
      'етапу збору рекомендацій від керівників з попередніх місць працевлаштування. Наша вміння шукати і знаходити потрібну інформацію - основа '
      'безпеки для вашого бізнесу та запорука успішного результату у процесі підбору персоналу. '
      'Ми не допустимо, щоб до вас потрапив співробітник з туманною минувшиною!';

  static String why_we_title_6 = 'Вигідні гарантійні умови';
  static String why_we_about_6 =
      'При звільненні працівника наше агентство оперативно і безкоштовно підбере вам '
      'заміну або поверне вартість послуг, що були оплачені в процесі підбору. '
      'Ми зобов\'язані виконувати свої функції, і якщо працівник виявився ненадійним, ви не понесете '
  'втрат від його звільнення. Ми віримо в свою роботу і несемо відповідальність перед нашими клієнтами!';
  static String free_monitoring_learn_head =
      'Замовте безкоштовний моніторинг ринку праці!';
  static String free_monitoring_learn_more = 'Дізнайтеся:';
  static List<String> free_monitoring_learn_more_list = [
    'Яка вартість спеціаліста на ринку праці?',
    'Яка система мотивації для потрібної посади в інших організаціях?',
    'Які умови роботи пропонують керівники компаній-конкурентів?',
    'Який обсяг попиту та пропозицій на потрібну вакансію?'
  ];

// Strings for_employee page ----------------------------------------

  static String set_cv = 'ДОДАТИ РЕЗЮМЕ';
  static String set_cv_to_database = 'до нашої бази даних';
  static String no_file_selected = 'Файл не вибрано';
  static String select_file = 'Вибрати файл резюме';
  static String find_work = 'ПОШУК РОБОТИ:';
  static String send_cv_to_hr_library = 'Надішліть резюме в HR-Library';

  static List<String> about_cv = [
    'Наше рекрутингове агентство не гарантує вам працевлаштування, але ми додамо ваше резюме до нашої бази.',
    'Якщо ваші компетенції знадобляться на одному з проектів, ми зв\'яжемося з вами.',
    'Обов\'язково вкажіть у резюме діапазон ваших очікувань заробітної плати.',
    'Послуги для соискателів безкоштовні',
  ];

  static String how_do_cv = 'Як повинно бути складено резюме?';
  static String local_cv = 'Лаконічно';
  static String local_cv_more =
      'Не пишіть занадто багато, докладно викладаючи свою біографію. '
      'Розмір резюме не повинен перевищувати одну-дві сторінки друкуваного тексту, '
      'інакше його просто не будуть читати. Якщо ви змінили багато місць роботи - залиште тільки найважливіше - те, '
      'що принесло унікальний досвід, знання та навички.';
  static String presentable_cv = 'Презентабельно';
  static String presentable_cv_more =
      'У заголовку резюме потрібно вказати повне ім\'я, прізвище і по батькові, а також посаду, '
      'на яку ви претендуєте, і рівень заробітної плати.';
  static String health_full_cv = 'Корисно';
  static String health_full_cv_more =
      'Не варто писати багато про свої захоплення, роботодавця цікавлять ваші професійні якості: '
      'освіта, досвід роботи на інших підприємствах, реальні досягнення на попередніх місцях роботи, '
  'знання мов і рівень володіння комп\'ютером.';
  static String comfortable_cv = 'Зручно';
  static String comfortable_cv_more =
      'Потрібно вказати контактні дані: особистий телефон, електронна пошта або скайп, '
      'вказати зручний час для дзвінка, щоб працівник відділу кадрів міг точно з вами зв\'язатися. '
      'Переконайтеся, що ваш email співпадає з прізвищем, а не схожий на кличку або псевдонім.';

// special strings -----------------------------------------------------------

  static String more = 'Детальніше';
  static String learn_more = 'Дізнатися більше';
  static String contact_us_offer = 'Потрібні ефективні співробітники? Телефонуйте:';

  static String why_we = 'Чому ми?';
  static List<String> why_we_offer = [
    'Початок',
    'Про компанію',
    'Політика',
    'Контакти'
  ];

  static String who_give_work = 'Роботодавцю';
  static List<String> who_give_work_list = [
    'Підбір персоналу',
    'Executive search',
    'Head Hunting',
    'Аутсорсинг'
  ];

  static String who_worker = 'Соискателю';
  static List<String> who_worker_list = [
    'Поради кандидату',
    'Правила проходження співбесіди',
    'Підготовка до співбесіди',
    'Як написати резюме'
  ];

  static String our_offer =
      'Спеціалізуємося на підборі співробітників у таких напрямках:';
  static List<String> offers_way = [
    'IT, web, digital, зв\'язок, телекомунікації',
    'Продажі - керівники і менеджери',
    'Маркетинг, інтернет-маркетинг, реклама, PR',
    'Менеджмент (керівники) вищого рівня',
    'Адміністративна робота, секретаріат, ОЗМ',
    'Бухгалтерія, фінанси, податки, аудит',
    'HR, кадри, управління персоналом',
    'ІТР у промисловості та на виробництві',
    'Керівники і ІТР в проектуванні',
    'Транспортний відділ, логістика, ЗЕД',
    'Робочий персонал'
  ];

  static List<String> text_for_button_image = [
    'ПОШУК І ПІДБІР КВАЛІФІКОВАНИХ \n'
        '                    СПЕЦІАЛІСТІВ',
    'МАСОВИЙ ПІДБІР ЛІНІЙНОГО ПЕРСОНАЛУ',
    'EXECUTIVE SEARCH',
    'ХЕДХАНТИНГ',
    'АУТСОРСИНГ ПЕРСОНАЛУ'
  ];

  static List<String> text_about_offer = [


    'Кадровий консалтинг (HR-консалтинг)',
    'Послуги аутстаффінгу персоналу',
    'Регіональний підбір персоналу',
    'Пошук співробітників за резюме',
    'Кадровий аутсорсінг',
    'Ресерчинг (Експрес пошук)',
    'Скрінінг резюме'
  ];

  static List<String> text_more_about_offer = [
    'Консультування в ефективному управлінні персоналом',
    'Виведення персоналу за штат компанії.',
    'Підбір персоналу в регіонах України та інших країнах.',
    'Підбір відповідних резюме співробітників.',
    'Надання послуг з ведення кадрового документообігу',
    'Організація масового потоку соискателів без особистої зустрічі.',
    'Пошук резюме за вказаними Вами параметрами по різним базам.'
  ];

  // contact
  static const String number = 'Номер телефону';
  static const String enter_number = 'Введіть номер телефону';
  static const String invalid_number = 'Введіть правильний номер';

  // privacy politic
  static const String privacy_sting = 'Політика';
  static const String politic_sting = 'Конфіденційності';
  static const String privacy = '1. Наша обіцянка конфіденційності \n'
      'Ваша довіра є ключем до успіху нашого бізнесу. Ми дуже серйозно ставимося до приватності та конфіденційності '
      'і захищаємо Персональні дані наших користувачів відповідно до Політики Конфіденційності. \n'
      'Термін «Персональні дані» означає всю особисту інформацію про ідентифіковане індивідуальне введення користувачів, '
      'включаючи особисту інформацію про освіту, навички, таланти, кар\'єру та досвід роботи, а також іншу подібну інформацію '
      '(але виключаючи ділову контактну інформацію). \n'
      '2. Згода\n'
      'Використовуючи наші Онлайн-сервіси та надаючи нам Персональні дані, ви погоджуєтесь на їхній збір,'
      'використання та розкриття ваших особистих даних (включаючи в деяких випадках особисту фінансову інформацію для цілей облікового запису)'
      'нами з метою надання вам послуг через сайт HRLibrary.com.ua,'
      ' та керування вашим обліковим записом відповідно до: (a) Політики Конфіденційності, '
      '(b) будь-яка інша угода, яку ви могли укласти з нами, та (c) застосовні закони та правила.'
      ' Ви несете відповідальність за те, щоб ми були інформовані про правильну та актуальну контактну інформацію для вас. \n'
      '3. Розміщення інформації\n'
      'Розміщуючи будь-які Персональні дані в тих частинах нашого сайту, які доступні іншим користувачам,'
      ' включаючи будь-який контент, який може містити персональні дані, ви даєте згоду на відображення цього '
      'Персональні дані та використання цих користувачів цих Персональних даних. '
      'Інші користувачі (наприклад, потенційні роботодавці або рекрутери)'
      ', які використовують Онлайн-сервіси, матимуть доступ до Персональних даних, розміщених здобувачами. \n'
      '4. Зв\'язок\n'
      'Ви дозволяєте нам спілкуватися з вами щодо наших послуг та вашого облікового запису.'
      'Якщо ви шукаєте роботу, ви погоджуєтесь на те, що потенційні роботодавці зв\'яжуться з вами щодо можливостей працевлаштування.'
      'Ви дозволяєте нам спілкуватися з вами через Інтернет та за вказаною вами адресою електронної пошти.'
      'Ви розумієте та приймаєте ризик того, що Персональні дані та інформація, що передаються через Інтернет, '
      'можуть бути схильні до помилок або порушень безпеки. \n'
      '5. Обмін інформацією\n'
      'Ми не передаємо, не обмінюємо, не продаємо і жодним чином не розкриваємо ваші'
      'Персональні дані без вашої згоди, за винятком випадків, коли таке розкриття:'
      '(a) дозволено відповідно до Політики Конфіденційності; (b) вимагається згідно із законом; '
      '(c) відповідно до ордеру на обшук або постановою суду;'
      '(d) виправдано в ході розслідування скоєння злочину, порушення договору або порушення закону або ухвали. \n'
      '6. Вирішення суперечок\n'
      'Якщо у вас є питання, скарга чи суперечка щодо вашої особистої інформації'
      'або наші методи обробки особистої інформації, зв\'яжіться з нами через Розділ «Contact us» нашого сайту. \n'
      '7. Зміни\n'
      'Ми можемо час від часу вносити зміни до цієї Політики, і змінена форма '
      'Політика набуде чинності через 30 днів після публікації на цій сторінці.';
}
