class StringsUa {
  StringsUa._();

  static const String about = 'Трохи про';
  static const String us = ' Нас';

  static const String headline =
      'Знайдемо збіги між роботодавцем та працівником';
  static const String summary = 'Наша компанія на ринку з 2015 року. За цей час'
      'ми знайшли збіги між HR-фахівцями та компаніями понад 1000 разів.'
      'У нашій базі даних є інформація про переваги як співробітника, так і компанії, яка шукає нових фахівців,'
      'і ми прагнемо знайти точки перетину переваг один одного, щоб усі сторони були задоволені вибором.'
      'Наш алгоритм пропонує не лише швидке рішення, а й якісне.';
  static const String offer = 'Що ми обіцяємо';
  static const String registration = 'Реєстрація';
  static const String hr_specialist = 'HR спеціаліст';
  static const String company = 'Компанія';

  static const List<String> offers = [
    'Роботу',
    'Співробітників',
    'Підтримувати',
    'Конфіденційність',
    'Швидкий зв\'язок',
    'Кращу пропозицію',
    'Кар\'єрні можливості',
    'Ефективне спілкування',
    'Оптимальна відповідність',
    'Приватність',
    'Негайна відповідь',
    'Професійний ріст',
    'Індивідуальні рішення',
    'Оцінку навичок',
    'Допомога клієнтам',
    'Перспективи розвитку',
    'Безпечна обробка даних',
    'Розвиток кар\'єри',
    'Індивідуальний підхід'
  ];

  // sign in and registration item
  static const String sign_in = 'Увійти';
  static const String like_company = 'як компанія';
  static const String like_hr = 'як HR';
  static const String remember = 'Запам\'ятати';
  static const String welcome = 'Ласкаво просимо';
  static const String enter_mail_password =
      'Введіть email та пароль щоб продовжити.';
  static const String enter_info = 'Введите информациию.';
  static const String empty_text = 'Будь ласка, введіть текст';
  static const String invalid_email = 'Будь ласка, введіть коректний email';
  static const String invalid_site = 'Будь ласка, введіть коректний сайт';
  static const String email = 'Електронна пошта';
  static const String site = 'Сайт';
  static const String registration_company_name = 'Назва компанії';
  static const String description = 'Опис';
  static const String enter_email = 'Введіть email';
  static const String enter_site = 'Введіть сайт';
  static const String enter_description = 'Введіть опис';
  static const String enter_company_name = 'Введіть назва компанії';
  static const String small_password = 'Пароль має бути не менше 6-ти символів';
  static const String password = 'Пароль';
  static const String enter_password = 'Введіть пароль';
  static const String tell_about = '';
  static const String the = '';
  static const String select_country = 'Оберіть країну';
  static const String tell_about_yourself = 'Розкажіть про себе';
  static const String name = 'Ім\'я';
  static const String enter_name = 'Введіть ім\'я';
  static const String last_name = 'Прізвище';
  static const String enter_last_name = 'Введіть прізвище';
  static const String success = 'Реєстрація успішна';
  static const String success_wait_for_email =
      'зачекайте, поки наш менеджер не зв\'яжеться з вами';

  // contact
  static const String if_have = 'Якщо є ';
  static const String question = 'питання';
  static const String number = 'Номер телефону';
  static const String enter_number = 'Введіть номер телефону';
  static const String call_me = 'Подзвонити мені';
  static const String call_to = 'Виклик на номер ';
  static const String invalid_number = 'Введіть правильний номер';

  // error message
  static const String email_not_founded = 'email не знайдений';

  // privacy politic
  static const String privacy_sting = 'Політика';
  static const String politic_sting = 'Конфіденційності';
  static const String privacy = '1. Наша обіцянка конфіденційності \n'
      'Ваша довіра є ключем до успіху нашого бізнесу. Ми дуже серйозно ставимося до приватності та конфіденційності '
      'і захищаємо Персональні дані наших користувачів відповідно до Політики Конфіденційності. \n'
      'Термін «Персональні дані» означає всю особисту інформацію про ідентифіковане індивідуальне введення користувачів, '
      'включаючи особисту інформацію про освіту, навички, таланти, кар\'єру та досвід роботи, а також іншу подібну інформацію '
      '(але виключаючи ділову контактну інформацію). \n'
      '2. Згода\n'
      'Використовуючи наші Онлайн-сервіси та надаючи нам Персональні дані, ви погоджуєтесь на їхній збір,'
      'використання та розкриття ваших особистих даних (включаючи в деяких випадках особисту фінансову інформацію для цілей облікового запису)'
      'нами з метою надання вам послуг через сайт HRLibrary.com.ua,'
      ' та керування вашим обліковим записом відповідно до: (a) Політики Конфіденційності, '
      '(b) будь-яка інша угода, яку ви могли укласти з нами, та (c) застосовні закони та правила.'
      ' Ви несете відповідальність за те, щоб ми були інформовані про правильну та актуальну контактну інформацію для вас. \n'
      '3. Розміщення інформації\n'
      'Розміщуючи будь-які Персональні дані в тих частинах нашого сайту, які доступні іншим користувачам,'
      ' включаючи будь-який контент, який може містити персональні дані, ви даєте згоду на відображення цього '
      'Персональні дані та використання цих користувачів цих Персональних даних. '
      'Інші користувачі (наприклад, потенційні роботодавці або рекрутери)'
      ', які використовують Онлайн-сервіси, матимуть доступ до Персональних даних, розміщених здобувачами. \n'
      '4. Зв\'язок\n'
      'Ви дозволяєте нам спілкуватися з вами щодо наших послуг та вашого облікового запису.'
      'Якщо ви шукаєте роботу, ви погоджуєтесь на те, що потенційні роботодавці зв\'яжуться з вами щодо можливостей працевлаштування.'
      'Ви дозволяєте нам спілкуватися з вами через Інтернет та за вказаною вами адресою електронної пошти.'
      'Ви розумієте та приймаєте ризик того, що Персональні дані та інформація, що передаються через Інтернет, '
      'можуть бути схильні до помилок або порушень безпеки. \n'
      '5. Обмін інформацією\n'
      'Ми не передаємо, не обмінюємо, не продаємо і жодним чином не розкриваємо ваші'
      'Персональні дані без вашої згоди, за винятком випадків, коли таке розкриття:'
      '(a) дозволено відповідно до Політики Конфіденційності; (b) вимагається згідно із законом; '
      '(c) відповідно до ордеру на обшук або постановою суду;'
      '(d) виправдано в ході розслідування скоєння злочину, порушення договору або порушення закону або ухвали. \n'
      '6. Вирішення суперечок\n'
      'Якщо у вас є питання, скарга чи суперечка щодо вашої особистої інформації'
      'або наші методи обробки особистої інформації, зв\'яжіться з нами через Розділ «Contact us» нашого сайту. \n'
      '7. Зміни\n'
      'Ми можемо час від часу вносити зміни до цієї Політики, і змінена форма '
      'Політика набуде чинності через 30 днів після публікації на цій сторінці.';
}
