class StringsRu {
  StringsRu._();

  static const String about = 'Немного о';
  static const String us = ' Нас';

  static const String headline =
      'Найдем совпадения между работодателем и работником';
  static const String summary = 'Наша компания на рынке с 2015 года. За это время'
      'мы нашли совпадения между HR-специалистами и компаниями более 1000 раз.'
      'В нашей базе данных есть информация о предпочтениях как сотрудника, так и компании, ищущей новых специалистов,'
      'и мы стремимся найти точки пересечения предпочтений друг друга, чтобы все стороны были довольны выбором.'
      'Наш алгоритм предлагает не только быстрое решение, но и качественное.';
  static const String offer = 'Что мы обещаем';
  static const String registration = 'Регестрация';
  static const String hr_specialist = 'HR специалист';
  static const String company = 'Компания';

  static const List<String> offers = [
  'Работу',
  'Сотрудников',
  'Поддерживать',
  'Конфиденциальность',
  'Быструю связь',
  'Лучшее предложение',
  'Карьерные возможности',
  'Эффективное общение',
  'Оптимальное соответствие',
  'Приватность',
  'Незамедлительный ответ',
  'Профессиональный рост',
  'Индивидуальные решения',
  'Оценку навыков',
  'Помощь клиентам',
  'Перспективы развития',
  'Безопасная обработка данных',
  'Развитие карьеры',
  'Индивидуальные подход'
  ];

  // sign in and registration item
  static const String sign_in = 'Войти';
  static const String like_company = 'как компания';
  static const String like_hr = 'как HR';
  static const String remember = 'Запомнить';
  static const String welcome = 'Добро пожаловать';
  static const String enter_mail_password =
      'Введите email и пароль что бы продолжить.';
  static const String enter_info = 'Введите информацию.';
  static const String empty_text = 'Пожалуйста введите текст';
  static const String invalid_email = 'Пожалуйста введите корректный email';
  static const String invalid_site = 'Пожалуйста введите корректный сайт';
  static const String email = 'Электронная почта';
  static const String site = 'Сайт';
  static const String registration_company_name = 'Названиие компании';
  static const String description = 'Описание';
  static const String enter_email = 'Введите email';
  static const String enter_site = 'Введите сайт';
  static const String enter_description = 'Введите описание';
  static const String enter_company_name = 'Введите название компании';
  static const String small_password = 'Пароль должен быть не менее 6-ти символов';
  static const String password = 'Пароль';
  static const String enter_password = 'Введите пароль';
  static const String tell_about = '';
  static const String the = '';
  static const String select_country = 'Выберете страну';
  static const String tell_about_yourself = 'Расскажите о себе';
  static const String name = 'Имя';
  static const String enter_name = 'Введите имя';
  static const String last_name = 'Фамилия';
  static const String enter_last_name = 'Введите фамилию';
  static const String success = 'Регестрация успешна';
  static const String success_wait_for_email = 'подождите пока наш менеджер не свяжется с вами';

  // contact
  static const String if_have = 'Если есть ';
  static const String question = 'вопросы';
  static const String number = 'Номер телефона';
  static const String enter_number = 'Введите номер телефона';
  static const String call = 'Позвонить мне';
  static const String call_to = 'Вызов на номер ';
  static const String invalid_number = 'Введите корректный номер';

  // error message
  static const String email_not_founded = 'email не найден';

  // privacy politic
  static const String privacy_sting = 'Политика';
  static const String politic_sting = 'Конфиденциальности';
  static const String privacy = '1. Наше обещание конфиденциальности \n '
      'Ваше доверие является ключом к успеху нашего бизнеса. Мы очень серьезно относимся к приватности и конфиденциальности '
      'и защищаем Персональные данные наших пользователей в соответствии с Политикой Конфиденциальности. \n'
      'Термин «Персональные данные» означает всю личную информацию об идентифицируемом индивидуальном вводе пользователей, '
      'включая личную информацию об образовании, навыках, талантах, карьере и опыте работы, а также другую подобную информацию '
      '(но исключая деловую контактную информацию). \n'
      '2. Согласие\n'
      'Используя наши Онлайн-сервисы и предоставляя нам Персональные данные, вы соглашаетесь на их сбор,'
      'использование и раскрытие ваших личных данных (включая в некоторых случаях личную финансовую информацию для целей учетной записи)'
      'нами с целью предоставления вам услуг через сайт HRLibrary.com.ua,'
      ' и управление вашей учетной записью в соответствии с: (a) Политикой Конфиденциальности, '
      '(b) любое другое соглашение, которое вы могли заключить с нами, и (c) применимые законы и правила.'
      ' Вы несете ответственность за то, чтобы мы были информированы о правильной и актуальной контактной информации для вас. \n'
      '3. Размещение информации\n'
      'Размещая любые Персональные данные в тех частях нашего сайта, которые доступны другим пользователям,'
      ' включая любой контент, который может содержать персональные данные, вы даете согласие на отображение этого '
      'Персональные данные и использование этими пользователями этих Персональных данных. '
      'Другие пользователи (например, потенциальные работодатели или рекрутеры)'
      ', которые используют Онлайн-сервисы, будут иметь доступ к Персональным данным, размещенным соискателями. \n'
      '4. Связь\n'
      'Вы разрешаете нам общаться с вами по поводу наших услуг и вашей учетной записи.'
      'Если вы ищете работу, вы соглашаетесь на то, что потенциальные работодатели свяжутся с вами по поводу возможностей трудоустройства.'
      'Вы разрешаете нам общаться с вами через Интернет и по указанному вами адресу электронной почты.'
      'Вы понимаете и принимаете риск того, что Персональные данные и информация, передаваемые через Интернет, '
      'могут быть подвержены ошибкам или нарушениям безопасности. \n'
      '5. Обмен информацией\n'
      'Мы не передаем, не обмениваем, не продаем и никаким образом не раскрываем ваши '
      'Персональные данные без вашего согласия, за исключением случаев, когда такое раскрытие:'
      ' (a) разрешено в соответствии с Политикой Конфиденциальности; (b) требуется по закону; '
      '(c) в соответствии с ордером на обыск или постановлением суда;'
      'или (d) оправдано в ходе расследования совершения преступления, нарушения договора или нарушения закона или постановления. \n'
      '6. Разрешение споров\n'
      'Если у вас есть вопрос, жалоба или спор относительно вашей личной информации'
      'или наши методы обработки личной информации, свяжитесь с нами через Раздел «Contact us» нашего сайта. \n'
      '7. Изменения\n'
      'Мы можем время от времени вносить изменения в настоящую Политику, и измененная форма '
      'Политика вступит в силу через 30 дней после публикации на этой странице.';

}
